{"content":"pretty Kool , but didn't understand how to get into past life photos, the reason I downloaded this app. The cartoons were fun,but I'm going to get my $back jack.","score":3,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.999476254}
{"content":"Useless","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9992974997}
{"content":"Ok, I guess, but not for the creation of original ai images. When I give the ai an example picture, I don't want an almost identical copy back. Big promises, but no originality. And then I give a completely different prompt and get almost the same image again. Seriously??","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994961023}
{"content":"It's called \"Wonder\" because I wonder why anyone would download this app. The community guidelines are a joke. Creative expression is NOT an option.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995000362}
{"content":"Absolutely fanominal!!! But scary as hell too!!! I'm Anglo Saxon and Cherokee, I would love to know more!!","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9958792925}
{"content":"I didn't mean two men that is gross","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9920946956}
{"content":"I'm sorry. What was the point of buying pro back if you need to get credits now to make stuff? Absolute scam","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994981289}
{"content":"Ask for a review before I can see the art? Here you go.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9973172545}
{"content":"great except the community's guide lines tried another ai to make compliant still didntwork","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9984347224}
{"content":"I purchased the lifetime subscription, and the app no longer generates images. It keeps crashing. Now it's stuck on every single prompt won't generate any image due to \"being detected to have keywords against their community guidelines and NSFW\" but does not state what keywords, just does not generate any new images.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995092154}
{"content":"I would ask for specific details and they would not be there.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995012283}
{"content":"Well after 5 months, it's decided that my lifetime membership wasn't enough and now wants me to pay AGAIN! UNTIL THEN, I CAN'T USE THE APP ANYMORE, GARBAGE! Update: 5\/17\/23 Google is counting these scammer's auto email as a response, and refuses to refund. This is a scam and Google is responsible! Let's all make Google pay! Class Action Lawsuit","score":1,"reviewCreatedVersion":"2.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.999481976}
{"content":"Im sorry to change my review on your program but im actually ever sorry i bought it The reason is aphalling image quality at times bad colouring and realisticness and its truly horrible when creating Elvis Presley and he comes out looking like Godzilla If i must say AI generator and imagine is in a way a lot better than Wonder which has a lot of improvements to undergo to change its dull unrealistic colour images Im not impressed by Wonders art creation at all","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994990826}
{"content":"There is a NSFW filter that is so strict that the app is basically unusable.","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994955063}
{"content":"This app is getting worse and worse censoring more words and phrases that aren't even NSFW. I paid for a lifetime license because I enjoyed using this AI software. Now I feel ripped off with how badly the developers have crippled this software. This software is a scam. I'm considering reporting this company to the better Business bureau.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995110035}
{"content":"Loved this app so much I paid the one time cost to purchase it not knowing it wouldn't transfer to a new device. So if you ever plan on getting a new phone- or even if you don't plan on it and your phone breaks and you have to get a new one, you'll be out the $30.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9926054478}
{"content":"like, totally","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9973243475}
{"content":"it was a good app but now it's saying I am putting NSFW content even though I only put something like brown hair, blueish green eyes, 18 year old boy, emo hairstyle and glasses, and it's saying I put something age restricted, so unless you fix this problem I am not going to be using this app anymore.","score":1,"reviewCreatedVersion":"4.1.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995009899}
{"content":"Garbage. Bought lifetime subscription. Now it's useless. The nsfw false flags are going overboard along with the art generation capability.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994969368}
{"content":"pro version shows so early","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9970427155}
{"content":"The AI on this app has not been updated since September 2021 its information is out dated and its responses are not relevant.","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995090961}
{"content":"The advertisement for this is VERY MISLEADING","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994989634}
{"content":"Censorship at its finest. The words \"basement, man, against, smiling classroom, clean-shaven and laboratory\" is actually against their guidelines. How is anybody supposed to make anything?? also I paid for 200 credits and didn't receive any. They told me they'd look into it and never did","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994906187}
{"content":"This app used to be pretty good. Now it's behind the curve. Tell me how this prompt is against community guidelines or NSFW: Grey alien, sneaking, photorealism, blank studio backdrop.","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9989790916}
{"content":"This app totally sucks and I can't freaking cancel it. Don't do it unless you want to be charged five bucks a week for some dumb looking stuff that you could get for free and not be able to cancel the app, email support OR cancel.","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995068312}
{"content":"The NSFW words are out of control!! (Grass, Skirt, Class, Floral, Alluring, Coral, etc) are now considered inappropriate. And when we find other words that work, it later calls it inappropriate. (Ex: Sexy is NSFW. Used Seductive, then Sensual, Alluring, Enticing, now Sultry. Had to user kilt for skirt. Girdle for corset. Swimsuit for bikini, field for grass & lecture room for class room.) It's insane :face_with_symbols_on_mouth::angry_face_with_horns:","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.998495698}
{"content":"Just dont like.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9993108511}
{"content":"cool","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.996170342}
{"content":"Love it, one of the best apps out there, I write novels, and I love how you can just create characters from what you think in to art.","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9989240766}
{"content":"The censorship has gotten really bad. It's now censoring things that are not inappropriate at all","score":3,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994840622}
{"content":"Total scam, got it, completely useless, believed I had unsubscribed including not being able to see the icon on my screen but continued to pay $8 a WEEK! TOTAL MONEY GRABBING SCAM ARTISTS! STICK YA AI, IF THIS IS THE FUTURE, WE'RE IN BIG TROUBLE! DON'T FALL FOR THE FLASHY AD'S IT'S A WASTE OF TIME AND GIVING AI A BAD NAME. PUT ME OFF AI, THATS FOR SURE!","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994924068}
{"content":"I really enjoy this app. I do wish that they gave you more theme options when you buy the avatar packs. I also wish that there weren't as many restrictions on what it'll generate.","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9987481833}
{"content":"Well, if you can even get it to work, which you won't, because it doesnt. You'll run into unnecessary prompt refusals based upon arbitrary community guidelines that forbid words like \"skinny,\" \"thin,\" and \"slender.\" I guess being any of those things is shameful and forbidden in today's culture. Total waste of time.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995079041}
{"content":"Still learning how to use this app.","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9985231757}
{"content":"Worked great for almost a full year. Now it's glitching and blocking every prompt saying it's NSFW. It tells me the word \"Glasses\" goes against the community standards, \"Soldier\" is another one. over the last 2 months, it's been heavily censored, and it won't tell you which words are blocked or why. there's no way to report these errors either.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994428754}
{"content":"Very easy to use, many selections, fast results","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9989058971}
{"content":"My experience with the app was that it didn't do what it was advertised to do. Honestly found it to be rather ridiculous and pointless.. Plus folks watch your subscriptions & the history. They charged me without my knowledge after what was supposed to have been a 3-day trial. If I can give it negative one star I would","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995107651}
{"content":"One of the worst apps to get results from. The best it ever did was change the shape of the face - no background, nothing that could be considered a photo prop - mothing","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995100498}
{"content":"Boring","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994260073}
{"content":"This app used to be a 5 star :glowing_star: easily. With excellent quality images. Anything you could think of. Anime, realistic photo, NSFW content. I paid for the pro membership. We'll worth it at the time. However now (1 year later) ... It's so restrictive you can't create anything worth downloading the app. Quality and capabilities have gone down the toilet. :chart_decreasing: Don't waste time or money on this app!","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995114803}
{"content":"Horrible. I uploaded all the required pictures then when it loads up it asked me to make an avatar. It waited until I was done to let me know I had to pay to finish making the avatar. Which was a complete waste of my time. Having to pay is not the issue, what is an issue is letting everyone who uses the app go through the whole process without knowing they had to pay for it. It's a letdown for those who can't pay. Also the 2 pictures that were generated are really bad honestly.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995036125}
{"content":"The worst","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9988333583}
{"content":"Meh I didn't even keep it for 20 minutes.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995026588}
{"content":"Useless garbage. It will refuse completely clean prompts for \"detected keywords that violate our community guidelines & NSFW policy.\" I'm not using any curse words or any suggestive language whatsoever and >50% of my prompts get flagged. I try to edit the prompt, but it doesn't work because there's seemingly no rhyme or reason to what gets blocked. Second, the ads are out of control. I understand being forced to view ads for a free service. Fine. This app takes it way too far. Do not download.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995135069}
{"content":"So many adds and not searching the specific search... So disappointed. I'll uninstall this app waste of times.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995046854}
{"content":"This app used to be awesome. Now it sucks. Not interested in renewing. It sucks now. Downgrade to zero stars.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.999499917}
{"content":"This is a really good art generator, Ive Been using it for almost 2 years now, I would really like it if they added a \"low poly\" style setting or something that can make the art look digital and unformed, like a simulation that isnt finished loading in or forming and there's polygons","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9987645149}
{"content":"I purchased the lifetime membership and it will not restore my account. I reached out to the support team with proof of purchase to no avail. 1 star for being ripped off.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995077848}
{"content":":blue_heart::blue_heart:New Ideas come alive in Wonder!:blue_heart::blue_heart:","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9981954694}
{"content":"CELLS TO SINGULARITY, THOUGH","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9953932762}
{"content":"*****100% SCAM ***** *****Do not use this app***** they are liand it will force you in to making a purchase after you sign up For their free trial period It will not give you the option to go around it is a scam 100%","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995070696}
{"content":"I'm new to all this so I am just waiting to try this app out","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9885912538}
{"content":"Absolute trash. Words that are banned: -Titanium","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9991061091}
{"content":"Does not do what was advertised. Just wants access to all my info. NO!","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995011091}
{"content":"best Si photo gallery","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9969267249}
{"content":"Trash don't bother total waste nothing you're going to want the best thing abt it is the trailer","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9993848801}
{"content":"Scam app is garbage","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994794726}
{"content":"very soliciting","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9966084957}
{"content":"Very very difficult to understand does not give an explanation of anything to use on this app it is very confusing to say the least","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995102882}
{"content":"While at the start it was an ok art GAI app, it became worse and worse. Their premium lifetime fee turns out to be a scam, and the app often even fails to open, getting stuck. I don't recommend anyone pay any money for this, and even don't recommend the free version. Try midjourney or literally any other GAI art app. Save yourself the headache.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995093346}
{"content":"I've used this app since the very beginning of its release and a subscription used to be worth the WEEKLY cost. Not anymore. What is it with people always trying to fix something that IS NOT BROKEN!?","score":3,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9973347783}
{"content":"I downloaded this app because an ad about past live and thought it be fun but I got too much ads and no pics false advertisement","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995065928}
{"content":"Extreme censorship has unfortunately hit this app to the point where it's borderline unusable. \"Over Saturn\" for example is somehow considered NSFW along with countless other words and phrases that nobody in their right mind would be offended by. I've used the app extensively since late 2022 but it's unfortunately time to move on.","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.999504447}
{"content":"Your filter has errors, for example it won't create from this phrase \"blue and silver neon spaceghost man with enormous shoulder guards and antennas on thier head on an alien planet futuristic city with cars and flying saucer daytime \" , your filter didn't used to block this same phrase as well as other normal ones until recent changes in your filter,Wonder is the best of this kind of image generator I have seen yet","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9950572252}
{"content":"This app used to be quite good but now because it is extremely slow to load and cannot work because it sends a red error message saying that the words I've use does not comply with their guidelines. It doesn't matter what words you type, the same error message pops up. This in the pro version.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995086193}
{"content":"love it! I am getting used to the whole ai creation and this isn't a bad app it gives some pretty good creat>on the more you play into the description the better the ai can create what you are thinking. you don't have to pay for it that is the nice thing about it, but there is some definite benefits to getting PRO. the only thing I can complain about is the operating speed I have yet to try this app on other devices but so far on my Samsung tab 10 it runs super slow","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9988901019}
{"content":"This a truly scammers. Why.. this app is not friendly app. You need to recharge a big amount of cash to continue for about 1month..","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994918108}
{"content":"I liked","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9984220266}
{"content":"cars","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.8990689516}
{"content":"They thought it would be funny to say you needed to pay after they hyped you up for the cool photos","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9942190647}
{"content":"I purchased the lifetime subscription over 2 years ago after switching to a new phone about a year ago. I haven't been able to restore my purchase. I've discovered many others have had the same thing. I've contacted support with no help in restoring and honoring my lifetime account, which is now not an option. Do not download or give business it seems many have had these issues.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.999499917}
{"content":"Really sucked. Kept getting this NSFW message which was total BS because there was nothing in my sentence that was inappropriate. It created some weird picture with deformed punctuation marks and a lady with 3 arms.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994983673}
{"content":"Have only done one picture to try it but OMGOODNESS! tttoooo funny! Love this","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9987754226}
{"content":"It's not bad for generating stuff that you are trying to get to but not exactly get what you want but generally gets somewhere around what you want","score":4,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9982541203}
{"content":"Mixed emotions","score":5,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9937962294}
{"content":"I did what I needed,awesome w my player","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9988361001}
{"content":"Love it.","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9988468885}
{"content":"It's pretty okay at generating images, but their business practices are pretty terrible. Can't migrate paid account between devices, and after paying for a license you can expect them to keep changing their fairly arbitrary limitations and censorship policies without alerting you or telling you what exactly they are. Essentially a bait and switch.","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994939566}
{"content":"I was told that if I pay a certain amount that I would have this app for life!I pay and then you try to make me pay to make avatars!!What is up with that!?I want my money back asap!","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995055199}
{"content":"Did not show what I looked up kept showing random pictures","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994805455}
{"content":":red_heart::red_heart:","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9749246836}
{"content":"amazing app :grinning_face::thumbs_up: this is great to have!","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9988601208}
{"content":"Having a few issues with the prompts it's doing the same thing as the last app I used and it's kind of frustrating especially when the prompts are clear and coolhurst and precise and I literally don't know what the issue is I literally have to erase half the prompt for it to work even in the slightest","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994651675}
{"content":"Some results are weird, e.g. it will add extra limbs and tails to animals or show disembodied limbs floating around the main image, but this happens less often now than it used to. The app doesn't understand all prompts but now seems to get it right more than half the time, and some of the results are quite beautiful. Good variety of styles you can try for different effects. (They need to adjust their NSFW algorithm; e g. There is no way that the word \"Lace\" should violate community standards.)","score":3,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9987976551}
{"content":"I love this generator","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9988565445}
{"content":"App is overly sensitive :thumbs_down: and I ain't watching minute ads everytime either","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995023012}
{"content":"It's absolute trash now. Changed it to where you can say certain words because they deem them NSFW. When I first bought this. No matter what word i deleted, it still was bot ok... That was not an issue when I first got this app...","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994959831}
{"content":"nothing much yet!","score":3,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9984379411}
{"content":"Good so good I bought premium but now the NSFW detection is going crazy about the word (replace) it doesn't matter how you put it. if the word (replace) is found in the prompt it's just is a little to violent and horrible for the ai to make","score":3,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994782805}
{"content":"its all about MONEY !!!!","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.7048609257}
{"content":"Very Disappointed!!!!! I purchased a lifetime membership, but then after I was charged....... I went to use the app and it is set up that I have to buy credits to use?!??! What the heck?? I thought buying the lifetime membership was the one time purchase so I could use the app fully with no further purchases!!! What a total SCAM!!!!!! I WILL BE CONTACTING THEM FOR A REFUND ASAP!!!!! I doubt it will do any good to be honest! Very shady!!!!","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995110035}
{"content":"Too many ads and the thing can't listen or do what I want","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995049238}
{"content":"Too many ads very ambiguous especially with selecting pictures","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994887114}
{"content":"pushed to pay for it, pushed to upload three selfies for an avatar that isn't needed, seems like digital cloning to me. the YouTube ad has comments disabled and now I know why. scam","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994894266}
{"content":"Pro version is still limited to the 50 credit per day limitation?¿?","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9905474782}
{"content":"Seriously cool af. My suggestions would be a better rating system to help the a.i. and a way to toggle the haptic feedback off. Edit: I had paid almost $30 for the \"premium\" version about a year ago that was advertised as a one time purchase that would be valid \"lifetime\". This was a lie, as they now have the \"pro\" version out that for some reason voids my previous purchase and it won't let me restore it. I really liked this app too, sucks to suck.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9847872853}
{"content":"Was downloading because of artist I follow. Then I read the bad reviews and lack of customer service.... I'm good","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9950233698}
{"content":"nice","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9972729087}
{"content":"Their NSFW policy is bs","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9953563809}
{"content":"No free option other than 3 day trial uninstalled","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9993258715}
{"content":"Wanted to make a picture of a nice cozy cave, you know like a Hobbit might live in... But apparently the word \"cave\" is NSFW according to them. So...","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9982610345}
{"content":"I've been using, and loving this app, for 2 years. I've even made purchases...But the developer's community standards, & NSFW policy. Has rendered this app, basically useless to anyone over the age of 12. Or who isn't on television in the 1950s... Even some normal words, that they have no reason to censor, are off limits! It's a tad bit tyrannical. I guess, much to my dismay.. I'll have to go find something new...You had a perfectly good thing going.. and you ruined it with censorship..smh","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994872808}
{"content":"UPDATED REVIEW: Paid for the ad free version a year ago and they decide to change it where I have credits to use and once I run out I get ads. Yeah... no thanks.","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994698167}
{"content":"I gave it five stars long ago... Now this is the shittiest AI app I've seen in my life. Not only it restricts words that I don't even know why they're restricted, it won't tell you why and what... This is a perfect example of an app that goes worse every month it's there. I am happy I cancelled my subscription. Absolutely not worth it.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995110035}
{"content":"Doesn't load and is terrible with word generating","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.999504447}
{"content":"Really cool app! I loved the 50 face generated photos","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9988129139}
{"content":"Used to be pretty good app. Now every prompt results in a message that I used \"NSFW keywords\" but it won't tell me what they are, and none of the words I use are NSFW. Absolutely useless app now. Wish I could get my lifetime subscription money back","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995100498}
{"content":"Please stop. garbage for money","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994276166}
{"content":"Offer this as premium, since I must make a purchase in order to get past the title screen.","score":1,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9501905441}
{"content":"Creates really awesome content. I just wish it didn't flag my equations as NSFW when they're just numbers and symbols for equations.","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9982584119}
{"content":"This was the best art generator but your new community standards have made it completely unworkable.","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994795918}
{"content":"Paid for a lifetime subscription that they won't honor. Support Team nonexistent.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994982481}
{"content":"WAS a good experience. Recent \"upgrades\" killed an obviously popular and entertaining drawing application. Uninstall. Not wasted money, but hugely disappointed with the developer.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995075464}
{"content":"Dont waste your time downloading this nonsense","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994975328}
{"content":"Totally a scam.... The creator of this app is worse that the corona virus and should be arrested for making such a grossly blatant scam.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994975328}
{"content":"To be able to do anything you must give them your credit card for a free trial. Yeah right if I give them anything without knowing if it's worth it. Why ask for my credit card if it's worth it just give us the free trial. Nice try though.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9989472032}
{"content":"Paid for pro version, was logged out on an update and can never restore to pro version since. Reading the reviews I see I'm not the only one with this issue.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995006323}
{"content":"In past live one of the houses I recognized and I started crying","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9929560423}
{"content":"0 stars they robing people I didn't want subscription I canceled same day and said no refund that's very nice of them so don't support these thefts","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.999468267}
{"content":"Not Free","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9977267385}
{"content":"To many regular words in violation of operation, words like \"glass\" or \"bismuth\" or whatever. No fun having to defeat portions of a texted concept to please the overstrenuous guidelines. Used to be fun, no more. I hate it.","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994963408}
{"content":"Worst AI art generator I've ever seen. If you give it a photo for \"inspiration\" it uses your credits to drop YOUR photo as the \"generated\" results. If you use the negative prompt feature, it adds thise features in as PROMINENT points!","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995038509}
{"content":"I cant do anything everything is NSFW policy. Doesn't even work anymore you get the NSFW even by their default prompts. The ai is great the art is great I loved this app, but u can't do anything anymore on it might as well call it the NSFW. Watch the next update be different colors for the nsfw fonts. Take off the censorship it's ridiculous. Please fix it.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994782805}
{"content":"Worst AI app ever. I paid the lifetime fee for AI generation. Now, it makes me watch an ad to generate the image and still takes a credit. Also, when I tried AI on my pictures it turned me into a different race. Also, it wouldn't generate an image when I put in the word \"sky\", saying it was offensive or NSFW","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995074272}
{"content":"The broad NSFW filters have made this app totally unusable. The developer should switch to opting out of NSFW rather than using keywords to try and stop it since the coding here is really, REALLY bad. You cannot contact support. Look elsewhere.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995114803}
{"content":"It shows like it's a free app and then you go in and it asks you for your credit card this is unscrupulous","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994897842}
{"content":"Can't restore my Premium Account! I've had to change phones, and redownloaded the app. Restore function does not work (via app or via web) and it still has ad placement to create, and won't let me download in HD. It has my AI avatars, so it should remember my purchase?!","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994980097}
{"content":"It looks so cool. Please give me a promo code?","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9976261258}
{"content":"awesome to use for family photos","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9988157749}
{"content":"Waste of time","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9992181063}
{"content":"I wouldn't pay for it. It's okay I guess. Not worth the money they want.......should be free!!!","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995036125}
{"content":"Don't spend money on it. Not worth it.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994965792}
{"content":"Going through Google for refund because it won't let me restore my Lifetime subscription I paid for.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994909763}
{"content":"App isn't very good even with vivid descriptions. It just doesn't seem to know how to get what I want.","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995102882}
{"content":"This app sucks you have to pay for it","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994831085}
{"content":"Horrible misleading app. Says free then tries to charge you before proceeding. Won't let you go any further without paying. It's a total scam!!!!","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995038509}
{"content":"4 stars it needs a update i bought the premium and now it takes forever to download\/ save the picture...it wont let me a ave anymore pictures, please update it...other wise wouldve given 5 stars, such a good time killer and very addicting","score":4,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.984128952}
{"content":"Codeway digital offers no support for its products. Many users complain of reduced functionality, loss of premium status, and frequent errors that are ignored by codeway. Steer clear.","score":1,"reviewCreatedVersion":"1.4.3","sentiment_type":"NEGATIVE","sentiment_score":0.999504447}
{"content":"Do not install this app. It wants money from you right away. It's very hard to get rid of. It hides in other apps. And it doesn't do anything. It's probably malware","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995058775}
{"content":"So far looks to be interesting.","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.997816205}
{"content":"I think the limitations of the free version are deliberately bad to get me to buy the service. the input picture of my art was nearly the same as the output art.","score":1,"reviewCreatedVersion":"4.0.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995052814}
{"content":"Stupid money hungry company, watch ads for one generation. Then you pay money just for the Ai picture to not even match your description.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995036125}
{"content":"I paid for the lifetime subscription, I got a new phone and now I can't restore my purchase.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.999468863}
{"content":"Been using wonder Ai for a long time. Now it won't let me get passed the buy option :upside-down_face:","score":1,"reviewCreatedVersion":"2.6.0","sentiment_type":"NEGATIVE","sentiment_score":0.999497056}
{"content":"I'll update once fixed. Keeps saying keywords are inappropriate regardless of keywords being NORMAL. Il","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994420409}
{"content":"The only app. So far that has \"outdone\" the AI Art creator on the Zedge app. Has been ChatGPT4.0 w\/ Dall•e & Cosmic Dream. I always give other apps. A fair shot. W\/that said if your app. states that this prompt can't be attempted because it violates policy, I guess you might say it never made it out the starting gate:\"1930's era gangster Chocolate chip starfish playing an intense hand of poker with Angelfish at the bottom of the sea, insanely detailed, beautifully lit, fantastically imagined\"","score":2,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9975913763}
{"content":"Error message after every attempt to create","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.99949646}
{"content":"Bait click stay away","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9992346764}
{"content":"Almost realistic","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9946196079}
{"content":"Everything is pay only misleading","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994359612}
{"content":"What the hell?! I am describing TERRAIN and expecting output WITHOUT any people and the filters register that as NSFW?! On what planet does terrain and landscape details qualify as NSFW material?!!","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9993088245}
{"content":"It was a good app, but on text to image, there are too many restrictions, and I couldn't generate hardly anything. There are better apps out there!","score":3,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.999504447}
{"content":"White screen saying wonder Woopei doo.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9972726703}
{"content":"2 because of the countinous advertisments","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9992021918}
{"content":"Too many ads trying to force people to pay for it makes me not want to pay for it","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994829893}
{"content":"Looks :thumbs_up:","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9984057546}
{"content":"The quality of this app plunged. I've used it for years but it's now disappointing. Far behind newer apps in terms of features and functionality. Often gives bad results. BUT the worst thing about it is the level of censorship. It's UNACCEPTABLE. It now flags words like 'female', 'government' and 'document'. UNACCEPTABLY EXCESSIVE. YOU MUST cut back on the censorship. There is NO EXCUSE for it.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994989634}
{"content":"Can NOT for the life of me get it to make a character with Black, Gray, or Red skin tone.","score":3,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994951487}
{"content":"I attempted to use the app listing zodiac signs as the prompt. It said my prompt was against it's NSFW policy. All I typed was Capricorn, Aquarius tattoo. Useless app. Do not buy.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995033741}
{"content":"Training wheels in update are the last straw this company is grimy for life then 50 per day now those 50 credits don't even generate images of content pg13 stop censorship give warning and suggestion of parental guidance for under 21 stop vanilla sexyness being flagged as NSFW :no_one_under_eighteen: more freedom and less constraints are no longer features Making this app good","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994902611}
{"content":"Nothing even works for me","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994582534}
{"content":"It is very useful app but sometimes it generates extra figers etc","score":4,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9986293316}
{"content":"App use to make great ai photos and now they aren't even that great","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994891882}
{"content":"It was a little difficult to get it started. I'm not a good selfie taker, so that's probably why, but once I did, it turned out pretty incredible. Wow, I think I might actually share one of these pics","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9988331199}
{"content":"Says it's free to download the you have to pay. Nah I'm good","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9953816533}
{"content":"It's pretty good but the chat \"limit\" is actually so bad i wanna just pay money to get a normal a.i so it sucks apparently a banana man fighting a gorilla is also an \"inappropriate\" term but banana man with a gun isn't","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994418025}
{"content":"It told me my avatars were ready, then when I tried to access them it told me to pick 10 pictures again and showed me the prices again. How many times do have to pay for something. I guess I'm gonna have to say I don't like it!","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995024204}
{"content":"Bad just BAD","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994261265}
{"content":"Excellent I just love it wow it's fun","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9988762736}
{"content":"Fake app no feature","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994877577}
{"content":"I, like many others, have paid for the lifetime subscription of this app just to find that it actually isn't a lifetime subscription. I go to log in, and it asks me to buy the subscription despite having bought a lifetime subscription, and I have 5 credits. This is called false advertising and is a suable offense.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994801879}
{"content":"I had you at four stars, but had to knock it down by 3. There were prompts that I was free to use since I've got the app, and now I'm being censored all around. About to drop this","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995048046}
{"content":"I paid for the full version and now the app is refusing me access to what I paid for. EDIT: it is 6\/16\/24 and nothing has been done and no one has contacted me still.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994951487}
{"content":"Waste","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9986054301}
{"content":"Okay so now it's working but almost everything I type is now considered NSFW, I don't understand why. It was the word, necklace, are you serious?","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9992314577}
{"content":"Horrible app! Can't even do simple prompts and cartoons looks noting like the photos don't waste your money","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995070696}
{"content":"Way too many restrictions, considering it's a paid app.","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995064735}
{"content":"cool","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.996170342}
{"content":"I didn't get to download it because I can't .... It made me delete my three games I only have and it was important to me and there you go I know what my past life look like ... Huh ..","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994828701}
{"content":"good","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9985306263}
{"content":"Is this apps broken? I've tried using the same prompt as a day earlier but it said, it violates the guidelines","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995027781}
{"content":"it's amazing","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.998585701}
{"content":"Doesn't work","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994957447}
{"content":"definitely not the one worth paying for","score":3,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994783998}
{"content":"I can't restore my lifetime membership on my new phone, so now it's completely useless to me. I've emailed customer service several times and I only receive automated messages.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9995061159}
{"content":"Is false f@#$ing advertising!!!","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.999435842}
{"content":"It doesn't open","score":2,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994955063}
{"content":"Avoid AT ALL COSTS. The word woman goes against NSFW policy??? Woke waste of space.","score":1,"reviewCreatedVersion":"4.5.8","sentiment_type":"NEGATIVE","sentiment_score":0.9994338155}
{"content":"it's amazing, it helped me get 500,000 views on 52 second video I put on YouTube","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9987798333}
{"content":"So far very good experience...","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.998847723}
{"content":"Good! But it has limits...","score":4,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9985398054}
{"content":"F they do get","score":3,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.7319654226}
{"content":"I paid for it but i am disappointed","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994965792}
{"content":"It's amazing","score":5,"reviewCreatedVersion":"4.5.8","sentiment_type":"POSITIVE","sentiment_score":0.9985190034}
{"content":"Useless and it cant understand proper prompt","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994982481}
{"content":"Fair program, but a totally dishonrst ripoff company!","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994803071}
{"content":"amazing","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9985198379}
{"content":"I paid for lifetime access and it won't restore my purchase on a new device.","score":1,"reviewCreatedVersion":"4.1.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994841814}
{"content":"Legal","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9946697354}
{"content":"need to register free plan, could be charged if forgot to cancel.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9969876409}
{"content":":hundred_points: worst app","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994810224}
{"content":"I give this app one star because it doesn't offer anything less. I described the images of several different things I wanted. However, the app created images that were NOT as described. After 10 or 12 attempts with nothing correctly drawn as described, I canceled my subscription and deleted the app! It's absolutely the worst app I've EVER tried! If you choose to try it yourself, I wish you the best of luck. Maybe your designs will actually look like your description.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995136261}
{"content":"False advertisement","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994395375}
{"content":"Can't use it without money","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994360805}
{"content":"I had to wait for 6 minutes just for me to get the icon for past life then had to finish the ad then waited for another 3 minutes just to see that my past life was an old house. So I am a house before? My grandson also tried this on his phone, and also showed a house for visbpast life. So this is a joke then? Very poor app. NOT RECOMMENDABLE APP! Definitely uninstalled!","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995105267}
{"content":"Wonder AI Generator","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9974652529}
{"content":"They got their money and that's all they care about. Was way better at first. Now can't create anything because there are so many NSFW flags.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994901419}
{"content":"Too many adds and it does not give you your credit after watching a video","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994987249}
{"content":"app dint open first when it opened it got stuck l. forced adds of dating apps in the app which will not allow to go back app has to be killed and started again.. still it doesn't open","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994949102}
{"content":"I paid for the lifetime membership but I bought a new phone. On my new phone, I don't have pro and I have to buy a new membership or watch unbelievably long ads in between every prompt. I really liked this app while it worked.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995011091}
{"content":"Poor avatar selection, lousy all around","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994938374}
{"content":"Worth the money, I use Wonder to write messages to my customers, as well as art and meme creation. Has some of the standard hiccups of AI art gen, people sometimes have funky eyes, extra limbs and such....but as a pro user you can easily scrap it and try again.","score":4,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9988202453}
{"content":"It doesn't allow me to choose the account i sign in with. I've already purchased the lifetime subscription, and im unable to access it because i can't log in with the proper account.","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994983673}
{"content":"Wants money right off not user friendly","score":2,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994887114}
{"content":"App is a scam don't waste your time ad involvement means free so folks don't waste your time the investors already has done so all garbage","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995030165}
{"content":"This app is just TRASH","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994834661}
{"content":"so far so good and I think I'm hooked","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9987552166}
{"content":"I immediately unsubscribed and uninstalled this app due to false advertising on YouTube (you can get sued for false advertising). The people claimed this app dinds your past by keying in your your date of birth and your full name of D.O.B. So, i took a shot at it. I was disappointed that this app is AI art generator, that's it!!!","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.999494195}
{"content":"The ad said I could put my dob, where I grew up and would get photos of a past life. Completely not true at all.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994937181}
{"content":"I was so excited when I seen the results that I had to post it up Facebook","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9985496402}
{"content":"My app Won't restore my purchase on my new phone, which I've checked with Google support, and it's totally Wonders responsibility. The one time they \"replied\" to my emails, they just blamed Google and said they couldn't do anything and haven't replied since. It was also literally labeled a canned response. I really love the app, but I am not going to pay for something I already own. What a rip off. Awful customer service. Still not fixed 6\/12\/24","score":1,"reviewCreatedVersion":"3.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995100498}
{"content":"Worst application till now","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994695783}
{"content":"it's truly an amazing app truly the best","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9988166094}
{"content":"Wonder is a WONDERFUL ai art program that can create the most amazing, never before made or seen artwork.","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9987818599}
{"content":"horrible","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994408488}
{"content":"sucks","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9982099533}
{"content":"amazing, and it has lifted my spirits..","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9988530874}
{"content":"It does nothing that the advertisement said it would do. Nothing at all. Very much a disappointment don't bother.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995106459}
{"content":"I like the app","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9988636971}
{"content":"The app was pretty cool at first, and after you use the initial credits they give you, it says you can watch an ad to keep creating. Nope. As soon as you tap watch ad, it tells you to pay for the subscription. Waited a day to see if the credits are daily. Nothing. Just tells me to pay.","score":2,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994883537}
{"content":"Free version only allows you to make 5 art pieces a day, then if you want to make more art you have to pay. Some of the art it makes is cool.","score":2,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9733181}
{"content":"Doesn't work.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995034933}
{"content":"Saw this ad , look into your past life. Sounds interesting .Down loaded the app and all it did was lock my phone down and drain all my info .My phone got so hot I couldn't hold it. Hope they don't steal every thing I own .","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995026588}
{"content":"Absolutely garbage. Doesn't do what it says.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995055199}
{"content":"This is a trick no good no good all bs...don't waist your money.krap","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994955063}
{"content":"I love wonder app. It's results aren't far from what is intended. It has a friendly interface as well.","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.998886168}
{"content":"wonderful fantastic awesome magnificent and perfect","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9987345338}
{"content":"It drags all the time what a waste of money and time:thumbs_down: for me I'd give it a 0 rating","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995090961}
{"content":"Can't use without subscription","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9972239733}
{"content":"great for brainstorming","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9987664223}
{"content":"I paid $30 for lifetime use. Either give it back to me or issue a full refund.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994302392}
{"content":"Nop I'm not gonna pay for this app","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9993021488}
{"content":"The only thing that bothers me about this app is, why are you Representing your wonder name on my ai pictures when I brought the unlimited plan :thinking_face: which made the app mine. And there's no way to turn your name off. Also I got a new phone. Try to download this app. And then the app started charging me again. I will not pay again, so I'll just uninstall..","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994858503}
{"content":"Garbage","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994198084}
{"content":"I don't think this website is working anymore like it should. It doesn't understand simple commands anymore","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995115995}
{"content":"،Its paid apps only","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9980903268}
{"content":"the worst ai mix up ever. it made us women and crosseyed 0\/10 don't waste a single cent on this garbage app. I've spent 5 bucks on a lot of dumb stuff but this is bar my worst purchase to date","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994966984}
{"content":"Fake. They just want your money.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994003773}
{"content":"I paid for the lifetime subscription and then changed phones. The subscription won't restore on the new phone and after attempting to contact support via email and socials there has not been any response. I guess they are happy if someone pays and can't get the service.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994980097}
{"content":"Bogus","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9992637038}
{"content":"not expecting this but ok","score":3,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9891742468}
{"content":"Its not of what I expected.. Thank you","score":1,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9988840222}
{"content":"Don't install this application, it's wroth & time waste. This is very 3rd class application.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995045662}
{"content":"I was charged when trying free. No way to unsubcribe","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994619489}
{"content":"Very nice","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9986618757}
{"content":"Its fun but a flawed ad system","score":5,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.997390449}
{"content":"No longer has lifetime subscription. They basically took it away from users who already paid for it in the past.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9993207455}
{"content":"Didn't work as promised","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995006323}
{"content":"First it was working then after sometime it just crashes","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995054007}
{"content":"I love Wonder but I have $30 Unlimited. Why do I now have to pay for credits??? Makes no sense","score":4,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994833469}
{"content":"Tried this app again and still crashes half the time when displaying the results. Token lost. Prompt gone. Image unsaved. Don't waste time with this. More headache than it'll be worth. It's a shame the most versatile ai painter has such a huge problem.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995064735}
{"content":"How to check past life? Not user friendly. Uninstalling now","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994882345}
{"content":"I bought 200 credits to be able to download more photos and was charged and never received them. Customer support is not responding. Don't give this app your money. It's a scam. You get a few free photos every day but have to watch a 30 second ad every time you download one.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995107651}
{"content":"I love this app and I pay for it and use it a lot. Highly recommend. However if you guys changed something in the art output, in the last month put it back please. It's like it devolved a bit for instance pop art doesn't even pop art anymore it's too weirdly real, if you do people, like a whole different style. It's gone back to looking a bit deformed in some styles. I've generated some beautiful work easily here, don't compensate for what people can learn through prompt sharing .","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9985364676}
{"content":"Yeah you have to pay for everything blah Boring I wouldn't pay for something if I can't even try it first","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995003939}
{"content":"BS app.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.996547997}
{"content":"Paid for Lifetime, but does not work anymore. Warning to all users. No help from devs or support team. Dead app! Negative review stays until support is provided to all Lifetime users!","score":1,"reviewCreatedVersion":"4.1.1","sentiment_type":"NEGATIVE","sentiment_score":0.999499917}
{"content":"Misleading, want to cancel, uninstall","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994915724}
{"content":"I got this on my old phone paid for the no ads lifetime fee and now I'm using it on my new phone and for whatever reason it's saying I have to pay again for the no ads lifetime thing.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9984155893}
{"content":"Another scamming app to make :money_bag: no thanks","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994221926}
{"content":"Very Slow. Lagging 100%","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.999494791}
{"content":"It completely ignores promts, the images generated are ugly as heck and you never end up with an image remotely close to what you asked for. Just a terrible app all around. And they want to charge you for it. Juat awful. I tried the free trial and it didn't get any better.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995100498}
{"content":"I purchased lifetime. But it will not restore. No other information or direction for fixing.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994738698}
{"content":"I've tried a lot of these apps and this one is by far the best always creates just about what I visualise","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9989299178}
{"content":"Noooh good","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9974862337}
{"content":"Not good at all they want you to pay for it okay it's not worth the price","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995058775}
{"content":"I paid and got nothing. I told customer support and they said thank you for your feedback and offered nothing to compensate for getting scammed. DON'T DO IT!!! THEY TOOK MY MONEY AND GAVE ME LITERALLY NOTHING IN RETURN! DO NOT PAY FOR ANYTHING! IT'S A SCAM!","score":1,"reviewCreatedVersion":"4.0.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995144606}
{"content":"You have to pay to run this app..","score":3,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.999435842}
{"content":"Don't like my personal info out. Would like the option to turn that off.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9975107908}
{"content":"scam","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9991445541}
{"content":"Wonderful :glasses:","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.998259604}
{"content":"This app works great. However, I bought the premium version, was able to use it twice, and then it reverted to the add version. I have tried asking them to help me fix it, and they just tell me to hit the restore button, which does nothing. Now, they won't respond to my emails.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994727969}
{"content":"Can't get enough","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9982188344}
{"content":"It Sucks . Never gives you in English. ??? Not even in foreign language. Just blah blah blah","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.999501586}
{"content":"the AI doesn't know how to spell basic words!","score":2,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994876385}
{"content":"pretty decent. wish I could purchase membership","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9985598922}
{"content":"Don't waste your money with this app. Paid for the lifetime app. It was good until I had to factory reset my phone. Now it won't restore my purchase and the app developer offers no support beyond email templates, which I tried and it didn't work. Sent 3 emails and nothing back. Good app. Terrible support. Look elsewhere for an app like this that offers better support.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995069504}
{"content":"I love this app Thank you!","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9989163876}
{"content":"MOST WORTHLESS APP IVE EVER INSTALLED!!","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9992421865}
{"content":"Wish they'd show us an official list of banned words in the app used to be a great app, but they keep banning words.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994966984}
{"content":"I've been charged $30 but haven't received the credits. Please help. Thanks.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9974755645}
{"content":"I tried to do the couple AI pic 2 different times, paid for both times, and it said opps something went wrong. It isn't generating my pictures at all","score":3,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995062351}
{"content":"Scam","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9990071654}
{"content":"Absolute trash, results generated do not match prompts, waste of time.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995098114}
{"content":"No matter what, it NEVER made whatever I wanted. Even with detailed descriptions. I just wasted my time on this, like a bunch of other \"AI art\" apps!","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995061159}
{"content":"Not paying just to generate art without being able to test the product without paying. this is dumb","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995033741}
{"content":"No any feature free, and no chance to try, directly you have to pay","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994657636}
{"content":"good","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9985306263}
{"content":"I attempted to use the Past Life feature, but it seems that I need to have something in my dream in order to proceed.. However, when I started to create it, an error occurred.. I understand that this may not be a userfriendly experience, and I would like to provide feedback so that it can be improved in the future..","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9971247315}
{"content":"Alam Kong peke ang binibenta nyo online kaya please naman magsarado na kayo","score":1,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9961383939}
{"content":"Waste of money. Policies make it so you can't type in anything.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994933605}
{"content":"Awesome!!!!!","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9986523986}
{"content":"awesome","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9985532165}
{"content":"An oliphant is not an elephant!","score":2,"reviewCreatedVersion":"4.0.0","sentiment_type":"POSITIVE","sentiment_score":0.9823223948}
{"content":"Every image I created was horrible!!! I don't even want to give it 1 star.","score":1,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.999510169}
{"content":"Find program nice but at same time slow. Might be better on the pc","score":3,"reviewCreatedVersion":"4.5.3","sentiment_type":"NEGATIVE","sentiment_score":0.9839103222}
{"content":"So far so good. I'm still trying to get the hang of \"concepts\". I'm not very tech savvy. Hopefully I get to learn how to apply this to my life to make it easier. More to be revealed. Gen X for life!!","score":5,"reviewCreatedVersion":"4.5.3","sentiment_type":"POSITIVE","sentiment_score":0.9985038042}
{"content":"This app suck. You need to watch a video before you can create. Wouldn't recommend","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995039701}
{"content":"What a waste of time. Money hungry app","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994885921}
{"content":"had to get a new phone and it wont let me restore my premium account. they wont email me back to help fix the problem.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994753003}
{"content":"I couldn't get a decent character image, the (1) I got was terrible , I cancelled after 10 minutes the app is not for Adult content, Nor is it dependable for projects or content for projects, 10 minutes of my life I can't ever replace . . . It's just a pile of DoggSh¡π steaming of course!!! I had a pro subscription that should be a good way to find out NOT :prohibited:","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995086193}
{"content":"What does app it's like dreams and your imagination","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9948570728}
{"content":"Bought the \"wonder for life\", can't restore and customer service less than useless. Keep away","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995058775}
{"content":"I changed phones and now your app is making me watch ads again. Your restore button DOES NOT work. Fix this soon as now you've taken my money and are denying my access to the product.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995031357}
{"content":"Absolute rubbish","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994695783}
{"content":"Don't download this app trust me It's fake","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994984865}
{"content":"Awesome","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9986000657}
{"content":"Total Scam. I downloaded this app, and paid the \"one time\" fee for unlimited use. It worked well for a while, but when I broke my phone, and had it replaced with the same model, the app wouldn't work. I emailed support, and they gave me some instructions to \"restore\" the app. But when that didn't work, they no longer respond to my emails. I have sent screenshots, and videos begging for help, and they have not responded. Waisted my money.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995027781}
{"content":"Am really interested in this app I like it ...its very fast and affordable waooh love you guys nicr app","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9989056587}
{"content":"Used to be a great app, but recently it hasn't been so good. Images won't save anymore.","score":3,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994945526}
{"content":"I don't want to pay for it, but it is telling me i have reached my chat limit. So I am going to keep deleting it and reinstall it because it is a very good app otherwise. If it did not have a chat limit, I would give it 5 stars.","score":3,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9969381094}
{"content":"Wonderful app","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9986876845}
{"content":"not as good as I thought","score":2,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9989790916}
{"content":"It doesn't look as good as I thought it would. I want a refund ASAP!!!","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995046854}
{"content":"My experience with the free trial is horrible. I don't like all the ai generated photo it's not that nice. So disappointed","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995002747}
{"content":"Worst AI","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9993839264}
{"content":"Not so good","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994652867}
{"content":"This app is not as how it is advertised","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994336963}
{"content":"Waste","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9986054301}
{"content":"Good pictures made from my picture pretty cool made me look more official than what I am.","score":4,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.99667871}
{"content":"Very glitchy doesn't want to work","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994914532}
{"content":"This App set you up with automatic subscription :thumbs_down:. I wanted 3 day trail and i will choose if i want to continue.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994649291}
{"content":"Totally fake, I asked for \"Zombified Drake hitting the Greddy at grimace's funeral\" and all it gave me was a zombie picture. NO DRAKE, NO GREDDY, NO GRIMACE, NO FUNERAL. ngl the art looked pretty good, but you have to watch an ad every time you wanna create another picture.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994685054}
{"content":"OMG","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9622703195}
{"content":"APLIKASI SAMPAH","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.5284454226}
{"content":"Paid lifetime..... then I got a new phone, the same account, and won't restore what I've paid for!","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994945526}
{"content":"Very good","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9986018538}
{"content":"Nice application","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9985303879}
{"content":"Slow and again Google's forced restrictions turned it into a preschool app!","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9989711046}
{"content":"LOVE IT !!!!!","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9988126755}
{"content":"This app is terrible. It wants to charge you for everything. And what it gives you isn't even that good. You're better off just using a free AI do not waste your money monthly paying for this or yearly. Please do not give this app. Any of your money? It is a complete waste..","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995061159}
{"content":"Deceptive marketing. Will charge you credit fees. Trouble canceling account. All a big hassle.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994946718}
{"content":"I just love this new Wonder AI I can change my Photos, I can cartoon myself haven't learned all the ends and outs yet but when I do I will be back for a update :grinning_face:","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9986324906}
{"content":"It won't tell you immediately, but you only have a small amount of free generations on a daily basis. Results are very iffy.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994797111}
{"content":"I need to pay","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.998355329}
{"content":"Wanted to see the past life places like advertised. All I got was ads and pay for anything you want to do.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994333386}
{"content":"Terrible app do not download and pay for anything through it. They will set you up with a subscription that you can never cancel and take $5 out of your account every week. Tried to get them to cancel it and they told me I had to cancel it through Google, which it never popped up in my Google subscriptions but always took the money out of my account. Worst app ever had to file a fraud charge claim on my card just to get the subscription to stop.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995070696}
{"content":"Terrible app never loads","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994984865}
{"content":"In all a great app, but not serious, I first paid the lifetime version, they thank me by only offering 50 credits... I won't forget this!!!","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9983459711}
{"content":"Life time plan changed to buying monthly coins. Doesn't download generated pictures anymore. Constant bugs. Hardly any support.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995023012}
{"content":"Is good,make what you ask....","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9945212603}
{"content":"STILL TESTING & I'M DEFINITELY NOT IMPRESSED WITH OUTPUT.. Between me and you, it's basically for simpletons.. When you can get an image to come out how you wish, it might take you 20 tries to get one. Basically, a social app is all this is. You follow me. :victory_hand:","score":2,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994996786}
{"content":"Best AI engine by far","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9979280233}
{"content":"I am unable to save images all of a sudden. Cant you fix this please?","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994811416}
{"content":"Not downloading.. paid for a year subscription.. was working fine.. now it stays stuck in the middle of downloading","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995057583}
{"content":"Made my phone freeze up had to uninstall.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994963408}
{"content":"Honestly sucks. It's one of the worse ai apps it's word sensitive so it theirs a bunch of rules to make it work.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.999507308}
{"content":"I would've gave 5 stars but \"lifetime subscription\" actually just means renew in a couple years what an absolute SCAM APP","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994827509}
{"content":"Awesome","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9986000657}
{"content":"App doesn't work","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994957447}
{"content":"I originally got this app for $25 but after getting a new phone it made me buy it again for $29 and now it wants me to pay for credits to keep using it after paying for it twice. I like it, but this is a scam, and Google needs to do something about it.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.999314785}
{"content":"never using this again","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9990665317}
{"content":"This AI app Is incredible. Nothing else you can say","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9985668063}
{"content":"Updating my Review. Wonder still struggles to create realistic hands or handheld objects, but it has improved slightly. Noticed issues when trying to save and download my art, when I download a high-resolution version of my pic, the app breaks down or freezes outright. Please resolve these issues, as soon as humanly possible. Thanks!","score":4,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9984694123}
{"content":"STARRYAI IS A FAR BETTER ALTERNATIVE AS THEY DO NOT LIMIT YOUR CREATIVITY, PLACE RESTRICTIONS ON YOUR PROMPTS OR CENSOR & REMOVE UNPUBLISHED CREATIONS. I REGRETFULLY BOUGHT THE LIFETIME MEMBERSHIP BECAUSE I LOVED THE APP BUT AFTER THEY GOT ALL THE MONEY OUT OF ME THEY COULD THEY ROLLED OUT AGGRESSIVE PROMPT AND IMAGE CENSORING & RESTRICTIONS. ESSENTIALLY IT IS NO LONGER THE THING I PAID TO USE & I FEEL LIKE I BOUGHT 1 THING THEN HAD IT TAKEN AND HAVE BEEN GIVEN SOMETHING ELSE IN ITS PLACE.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9985859394}
{"content":"You have to pay for every little thing....bs app","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994578958}
{"content":"I wanted a 3 day free trial but it charged me. I don't even like the app. Not what I'm looking for.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994990826}
{"content":"fun :drooling_face::smiling_face_with_sunglasses::zany_face:","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9978919625}
{"content":"Nice ai art app images come out great :grinning_face_with_big_eyes::thumbs_up:","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9987192154}
{"content":"Retarded app cannot understand prompts","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994910955}
{"content":"Totally scam they want money before using there app","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994916916}
{"content":"Useless","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9992974997}
{"content":"It's dumb as hell","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994883537}
{"content":"one fun app and great art to bad there isn't 6 stars","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9987113476}
{"content":"Not opening","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994737506}
{"content":"Its not working lol","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994705319}
{"content":"fine","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9843594432}
{"content":"its so much fun","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9986413121}
{"content":"I paid for weekly subscription on Google pay and it has yet to activate and says waiting for the developer.","score":2,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994814992}
{"content":"Man delete this on app store trash app. Just stealing money","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994503856}
{"content":"cool","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.996170342}
{"content":"I used to like this app, but recently the quality of the photos are bad, I have a pro membership, and now they introduced credits for making photos, basically making you pay money to generate stuff you aren't satisfied with.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994975328}
{"content":"Must pay to play","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9973932505}
{"content":"Images generate extremely quickly and are often exactly what i'm looking for but the download function simply doesn't work making it all pretty useless.","score":2,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994800687}
{"content":"I love art! this app is so much fun to play with!!","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9988999367}
{"content":"Downgrading my review. They took my money and ran. I bought the lifetime membership and it was 100 percent a scam. They still ask me to pay, no responses in customer service in 2 months. It is a scam, don't use it.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995094538}
{"content":"Same problem as everyone else, give me back my lifetime subscription. Got an error for typing in cute dog.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994700551}
{"content":"Very fun app, though at times I've tried to take existing photos and see what the AI can do with them only to be told they were NSFW even though the photo contained no nudity whatsoever. Would be nice if there were no sensors or filters.","score":4,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9980284572}
{"content":"It's literally the worst ai app i have ever seen and used. Pictures are awful and they try to make you pay for everything.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995009899}
{"content":"Produces black images half the time now","score":2,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9993306398}
{"content":"purchased the pro lifetime unlimited version of the app right at the start and now they decide to limit the pro version to 50 a day. which is NOT what I purchased. cannot be legal. I'll change my rating if the limits for old school Pro members are removed otherwise I really like the app. needs more styles added","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.992182076}
{"content":"Purchased the lifetime pro but can't get it to work on my new device even though they're both androids. I contacted the team, no response yet. And I've requested a refund.","score":2,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994907379}
{"content":"Lol it's fun to use","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9987674952}
{"content":"It's cool","score":3,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9950720668}
{"content":"customer service has been less than unhelpful. I lost my premium access due to moving phones. I login it pops up with a paywall. hit restore and nothing. I went to settings and hit restore. Nothing. synced my account. Nothing. I deleted the app did all that again. Nada reached out to CS and explained that I did all that and they told me to do it again. I said that I told them I did all that, sent videos, follow ups and they refuse to response. Horrendous. Terrible service. Don't expect help","score":2,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995077848}
{"content":"App was awesome until I needed to transfer to a new device, paid for lifetime member but have been trying to get help getting my prescription onto the new device for week, sending multiple emails with no real help or care to fix the problem","score":2,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994876385}
{"content":"Horrible. Full of ads and doesn't even draw what you ask for. Just a money grab. Typical greedy garbage.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995011091}
{"content":"simply cool","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9982277751}
{"content":"The AI is pretty weak. But I used it because I paid for the lifetime subscription. I got a new phone and I can't restore my purchase on the new device. Their customer support has not been helpful. Hopefully this gets their attention.","score":1,"reviewCreatedVersion":"4.5.0","sentiment_type":"NEGATIVE","sentiment_score":0.9993885756}
{"content":"You Used AI model in order to defame the religious figure \"Jesus with Tattoo\" really dude in order to make money. Why not you make your religion ? Respect other religions also.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9978488684}
{"content":"Crapp app. Lame. Boring, uses lots of battery life. A person could imagine better imagery that this sloooooow. \"a.i.\"","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994990826}
{"content":"Went from a decent app worth buying to a waste of time with micro transactions, even if you pay for the lifetime pass.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.999505043}
{"content":"Changed unlimted generations with premium to. A number a day with credits half off. Affter people bought it. And terrible customer service.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.998885572}
{"content":"paid the lifetime price amd now it wont let me log in. hit the \"already bought it\" and nothing happens. fix it or refund my money","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995037317}
{"content":"I loved this app. Paid for unlimited lifetime subscription and now it's been dropped to 50 images per day. That isn't what I signed up for and I feel conned. Update: And now virtually everything I type in gets filtered out by the NSFW filter. Even though it is in no way shape or form NSFW. Was a great app, now completely useless. Shame on the developers.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995052814}
{"content":"I paid for lifetime access, and they are not honoring that as they have since instituted a credit system per image. Also, the app continuously glitching and not creating the work. Totally useless app now, was once great.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995057583}
{"content":"nice designs","score":4,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9983273149}
{"content":"I switched devices, and I can not get my purchased version restored on my new phone. I've sent many emails where all I get is \"hit the restore button\" I'd appreciate an actual person to respond.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994889498}
{"content":":thumbs_up: :OK_hand: :thumbs_up:","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9987826943}
{"content":"Never subscribed yet the app is trying to bill my card, want this to stop. Had to take all of my card info off of Google because it is constant billing fraud.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994669557}
{"content":"It's free with ads but not good","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9993236065}
{"content":"Paid for the full version, lifetime not subscription, over a year ago. New updates and now I'm hitting a daily limit again. I click into my subscriptions and don't see it. I've emailed support with no resolution for the past week. 5\/7\/24- still no response.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994685054}
{"content":"Nice :thumbs_up: app, cools off.","score":4,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9988289475}
{"content":"I didn't get the avators i paid for","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995038509}
{"content":"it's junk","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994774461}
{"content":"I bought this app for the one time fee of $29.99 which gives you unlimited downloads all of a sudden this app is now asking for us to buy credits in order to use this app and the unlimited art downloads is no longer valid, I believe this is false advertising, I should have unlimited access for the $29.99 one time purchase but now out of the blue their asking us to purchase again & the one time fee for unlimited access is not being rewarded or acknowledged anymore.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995036125}
{"content":"This is amazing keep doing a great job, I love it! :grinning_face:","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9988771081}
{"content":"very awesome !!","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9986982346}
{"content":"Nice app","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9985741377}
{"content":"I wouldn't even give 1 star. Shocking customer service. Paid for lifetime, which they say you can use on other devices. Changed phone, restore Function does nothing. Emailed support explaining this. Auto response telling you the obvious, press restore button. Completely disregarding the customers original request. Then I replied to complain, either restore or refund. Got the same automated response. AVOID PAYING FOR THIS APP.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995110035}
{"content":"I’d like to purchase this application as a gift for my brothers. The issue isn’t buying it; rather, I’m unsure how to send them the application for download on their computers or cell phones","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9986382127}
{"content":"The art it creates for the portraits are truly awful. I paid for over 100 portrait avatars and not a single one was usable. They looked horrendous. Definitely don't recommend this app especially since it's not even free. You have to pay for the pro version AND pay for credits to create anything. Absolutely atrocious.","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.999506712}
{"content":"FRAUD. HAVE NOTHING TO DO WITH THIS APP. After running out of credits, it said I could watch an ad & create more; clicking the button only gave an option to purchase, no ad, no new art. It implied new credits today. None came. Clicked \"REMOVE LIMITS\" (no qualifier) & purchased. Got new credits, but it did NOT remove limits. Upon complaining, they emailed why they set limits. Now it falsely says I ran out of \"free artwork\" & can purchase more. Not free as promised! SO MUCH FALSE ADVERTISING!","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.999499321}
{"content":"This app works a lot better when you use a picture to reference itself by. If you're wanting a portrait of yourself drawing, reference an image of yourself for it to draw with a description, listing out the attributes of the drawing you want the AI to focus on. Remember the AI is coded by you so what you say is the outcome that is given. If you are receiving really rubbish pictures, it's because your description isn't adequate enough for the program.","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9979884624}
{"content":"app doesn't really seem to understand prompts. no matter what it kinda just creates it's own style and interpretation","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994977713}
{"content":"Time waste app this no open","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994907379}
{"content":"Fixed issues,","score":4,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9985024929}
{"content":"The app doesnt load on s23 ultra","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994130135}
{"content":"If you want something besides a portrait or landscape, it doesn't work well. I tried to import a picture and have it get creative and it did nothing.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995056391}
{"content":"*UPDATE* It has been almost a year since I first contacted the developer to get my access to pro restored. This developer is a crook. *UPDATE* I no longer have access to wonder pro. When I hit restore, nothing happens and I don't have access to the pro features. I paid for lifetime access to pro. I've emailed several times and I can't get a response.","score":1,"reviewCreatedVersion":"4.5.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995058775}
{"content":"Does not do the photos as asked","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994962215}
{"content":"F r o g w i t h g l o w i n g e y e s","score":4,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9855964184}
{"content":"Una basura, aunque pagues lo que se debe te sigue cobrando","score":1,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9924744964}
{"content":"So this is a joke, you can't do as many as you want if you buy the lifetime. They just say you reached what's allowed for the day. Don't waste your money","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.999502182}
{"content":"update: I'm giving this one star because I used to be able to make pretty much whatever I want, but now I keep getting a \"NSFW\" message every single time. I paid for the full version, I should be able to make what I want!","score":1,"reviewCreatedVersion":"4.5.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995088577}
{"content":"Something good and worth :sparkles: :relieved_face: :OK_hand:","score":5,"reviewCreatedVersion":"4.5.1","sentiment_type":"POSITIVE","sentiment_score":0.9978020787}
{"content":"It wasn't worth the download","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994976521}
{"content":"Thanks for the app. I am enjoying the out put given by the app. Will you make it possible to get the image in out put size 16:9 and 9:16? Please maker it available. Thank you very much...:folded_hands::folded_hands::folded_hands:","score":5,"reviewCreatedVersion":"4.5.0","sentiment_type":"POSITIVE","sentiment_score":0.9984512329}
{"content":"Terrible app, just do something else with your time","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995026588}
{"content":"Worked okay enough. But I paid for the lifetime premium and after a couple weeks they reverted me back to the free with ads. No attempt to reinstate my subscription through their app worked. Nobody ever emailed me back when I emailed support. They stole $25 from me. Use at your own risk.","score":1,"reviewCreatedVersion":"2.9.32","sentiment_type":"NEGATIVE","sentiment_score":0.9994825125}
{"content":"Paid for unlimited use ages ago. Now they're charging me again. Email support is a joke, as they just keep telling me to hit the restore button that doesn't work. It's a total waste of money. Definitely a scam.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995070696}
{"content":"Great app, but i already payed for Pro, i installed it on my new phone and the Restore button doesn't work, i reinstalled it again and the Restore button still doesn't work! I will change my review after you fix the issue because I'm not paying another 28€ for the app.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994753003}
{"content":"It will tell at last to purchase to complete the work instead of initially","score":2,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9905483127}
{"content":"I purchased Ai text to photo but need to pay for AI photo feature. Emailed 5 days ago regarding an issue but looks like they don't have customer support available.","score":1,"reviewCreatedVersion":"2.4.3","sentiment_type":"NEGATIVE","sentiment_score":0.9993159771}
{"content":"I love it, but in the last couple weeks something changed with the app & it has a very different look that I don't care for. I really hope they'll go back to their old style which was absolutely wonderful.","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9936339855}
{"content":"Not a free app. 3 day trail period, weekly or lifetime subscriptions after downloading the app","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9882295132}
{"content":"DO NOT PURCHASE !!! I swapped to a new mobile on the same platform. Restore does not work. Contacted them via email, Twitter, and Instagram with NO response. I paid a lifetime and now can't use it. Poor customer service. (9 months and still no contact) Now escalated to Google Play Store and had escalated.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.999509573}
{"content":"fantastic app","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9985460043}
{"content":"Good","score":3,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9984152317}
{"content":"Good","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9984152317}
{"content":"Epic...but expensive","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9894191027}
{"content":"Good overall app but purchased the pro version and it never unlocked it in the app. Spent over 36 dollars and now I can't even get a reply from support... Decent general app if you can deal with the ads but apparently the pay system doesn't work properly to unlock the full app. Still no contact from customer support. Doesn't seem to be any kind of help system or support. Dont waste money trying to unlock this app. Still jumping through hoops trying to get my money back from these thieves","score":1,"reviewCreatedVersion":"1.4.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995094538}
{"content":"My dearest friend turned me on to wonder. that's why they are my dearest friend...wootwoot..No, it's because they are the most awesome. But Wonder is still blowing my mind. Still beautiful and crazy..like a family member..or an ex.but way safer.","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9977594614}
{"content":"Couldn't even draw a walnut, kept drawing a flower","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994889498}
{"content":"perfect app","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9986917377}
{"content":"This app was great for a about year. The ai recently stopped rendering accurate or high-quality results, and the images are now pretty grotesque. Very disappointing now. I've downgraded my review from a previous five stars to just one. I also have the same problem as all other users who purchased a lifetime subscription that is not honored across devices or restored after updates. Kind of a ripoff unless they fix it.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995070696}
{"content":"Limiting my unlimited license? Don't give these people money","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994846582}
{"content":"Unable to use. When i clicked on the button to generate it showed ads to me. But this afs couldn't be skipped or it's not over. It just shows ads but not generated image","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995002747}
{"content":"Junk app.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.999292016}
{"content":"I paid for the full version last year, now it wants me upgrade, again, in order to get rid of ads","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9991758466}
{"content":"it just don't want to create what I ask it to something is always wrong","score":3,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995058775}
{"content":"Are you serious or you trying to make us pissed off with your ai art?! I mean each time I am trying to generate a good image it's getting me something so ancient newspaper style art","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994927645}
{"content":"Used to be amazing, I have the lifetime sub. I used this to generate pictures for D&D characters I was playing. It did humans easy and could do a bunch of stuff well. I don't know what they did recently but they changed it and now it generates pictures like any other trash AI art generator. 2*'s only because of what it used to do.","score":2,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9976935983}
{"content":"Good and getting better","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9985963702}
{"content":"Can't reach the customer support. Paid for the pro version and my old phone broke down. Not able to restore the pro version on my new phone. Also got some glitched up photos from the AI avatar option that you have to pay for separately and those were never compensated for in any way despite me trying to contact support several times. Willing to change review if these issues are fixed. edit: unistalled app. Switched to Bing.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994901419}
{"content":"I already bought the lifetime subscription bit it won't transfer to my new phone. Don't waste your money","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995036125}
{"content":"Rubbish","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9992849231}
{"content":"I will give this app an 0.5\/10 because it lacks alot and it doesn't give a proper work as I entered my name Sania for the signature and it give me the results of sibnaiva and other names signature. 0.5 point is just for its presentation. I would not recommend this app.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995057583}
{"content":"It's a great app, you know what to say.","score":5,"reviewCreatedVersion":"4.0.3","sentiment_type":"POSITIVE","sentiment_score":0.9988819957}
{"content":"I used the app before all the extra features, and it was great but the adds make it difficult to use. This is without mentioning every time I finish a add the thing crashes and I can't make the image, so if it's fixed I'll download the app again but for now it's not worth it. Along with the persistent adds, that after watching the app, it fails to generate the prompt. I can not recommend less.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995129108}
{"content":"It's very very bad software it will not allow you to post a single or a edit even a single photo and start asking for you paid version","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995058775}
{"content":"Trash :litter_in_bin_sign:","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.998573184}
{"content":"too much of ads just to test the apps whether it's suitable to subscribe or not","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994456172}
{"content":"Not free","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9979616404}
{"content":"The lifetime subscription isn't lifetime. Also, if you get a new phone or your new phone breaks, it doesn't transfer over. Great app, greedy company.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.995636642}
{"content":"Too bad","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994420409}
{"content":"nice app but taking to time","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.99843961}
{"content":"I love","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9983236194}
{"content":"Bad app","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994838238}
{"content":"Excellent app well worth the price","score":4,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9988812804}
{"content":":pile_of_poo::pile_of_poo::pile_of_poo::pile_of_poo::pile_of_poo:","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9980560541}
{"content":"Quite creative and PG. Good fun tool.","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.998814702}
{"content":"Many of the filters have completely changed since the update. They don't even match the prompts and are awful. Before the update I absolutely was obsessed with Pen&Ink. Now my character images are washed out and look diseased. Not to mention all the Asian inspired elements are gone. Extremely disappointed and spreading to the community.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995055199}
{"content":"The app was good at first, but over time it stopped working as well. Always getting an error message when trying to create something has been happening a lot lately. Also, getting NSFW blocked when certain keywords are in the prompt because of \"violence\" or \"bad words\/curse words\" when the prompt has nothing to do with violence. Yet, it's okay with nudity. It makes the AI app very limiting.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995027781}
{"content":"It's a 0 from me.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994961023}
{"content":"Images are wonderful, humans are much more realistic now, but the app will not synch my account settings on a new device- such as the fact that I PAID for it, and it still runs ads when I generate images! Other times it logs me in but tries to make me pay after a quota of \"free\" images for the day","score":3,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9971634746}
{"content":"Wonder has consistently provided me the required images, every time, without fail. A reliable App and a dependable one too.","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9989106655}
{"content":"Since Ive bought a subscription I haven't been able to make any new pictures. I really like the app but this is upsetting.","score":3,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994894266}
{"content":"It is a very nice app for memories","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9989026785}
{"content":"There's no free options, but the download makes you think there is","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9934234619}
{"content":"Terrible App,I paid for the lifetime and the same day would not let me create picture,wanted me to pay more money \"seriously \" ,DO NOT download this app!!!","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995076656}
{"content":"Constant issues with the server this week. Can't create anything despite paying for extra credit. I want a refund :confused_face:","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995106459}
{"content":"I've had it for about a week and already it's showing issues. Haven't been able to use it for the past 24 hours. Keeps delivering error messages.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995086193}
{"content":"Don't use this at all. Don't waste your money either. The all doesn't work for Android when you purchase the Lifetime. The developers won't help you either. Use other Ai image generators.","score":4,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.999505043}
{"content":"Really should've mentioned it was a subscription based app right from the beginning.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9993858337}
{"content":"App was working fine until yesterday. Now I'm getting an \"oops and error occurred. Please try again later\" notification every time I use it. Nothing is being done to fix this issue and I even paid for a lifetime subscription on day one.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995055199}
{"content":"Paid for the lifetime membership. Getting error \" Something went wrong\". This is an app issue as every other website is working. Will change it to 5 once app starts working . Edit : Tried uninstalling and reinstalling, still the same error. I wonder have these guys shut the app? :anxious_face_with_sweat:","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994705319}
{"content":"Best AI Art app I have found!","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9985213876}
{"content":"Was great for backgrounds and references for drawing and nice styles to work with. But now no longer renders images just says \"OOPS, something went wrong, try again later.\" and ignores prompt. This is pro and no longer works. Please fix this bug what's the point of having an app that does nothing.","score":3,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995018244}
{"content":"App stopped working. Error message \"Oops! Something went wrong \"","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994652867}
{"content":"\"Oops something went wrong. Please try again.\" Force stop, clear cache\/data restart solution doesn't work.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994716048}
{"content":"Completely worthless broken app. Even if it worked you have to pay a subscription and then pay even more for tokens. Garbage, won't even generate an image, just constant \"oops something went wrong, try again\". Do not download.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995125532}
{"content":"Something went wrong. The most picture it generates","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9961944818}
{"content":"I love this app and have lifetime plan. Tonight, however, no matter what I try to create, it says OOPS, SOMETHING WENT WRONG. please fix. There's no reason I should be having this problem","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9992482066}
{"content":"I paid for this and that's all it's giving me is an oops. This was a rip off","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995036125}
{"content":"Nothing is working right now. I reinstalled and still not working. Anyone experiencing this?","score":3,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994992018}
{"content":"I dont want to rate this, since the update, I cannot generate images, its says something went wrong try again later, can someone explain or fix this please, as this is my favourite app to use and my rating here, now doesn't reflect my true appreciation and joy using this app.","score":2,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9986579418}
{"content":"This app was great. But it seems like an update was done recently. Because now when I type in the same prompts I used before, the images are inaccurate. Guess I'll have to find a new app now...","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994658828}
{"content":"Really not that good","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994722009}
{"content":"So not only did they make the images uglier and make POC white, it stopped making images. Plus, the gorgeous take on photos are now chalky and ugly looking. People have complained... And you keep updating it and making it worse. I'm thinking about going to Midjourney","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995042086}
{"content":"\"Oops! Something went wrong. Please try again.\" Latest update seems to have broken it. Needs a dark mode.","score":2,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994431138}
{"content":"One of the worst app i downloaded.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994885921}
{"content":"I loved this app and used it all the time, and paid for the lifetime deal. I go to use it today and I get an error anytime I try to use it that something went wrong. I've updated it and reset it Uninstalled and still nothing the customer support just leads you through a rabbit hole and wasn't helpful at all. I'll put it back to five stars once I can use what I paid for.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9986122847}
{"content":"Paid and it keeps saying \"Something went wrong please try again later\" bs! Should've known better!:man_shrugging_light_skin_tone:","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9993950129}
{"content":"Paid aap","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9873686433}
{"content":"Since the last update it's become impossible to generate more than a couple of pictures before the app gets stuck \"generating\" and becomes unresponsive. I love this app and want to keep supporting it but it's borderline unusable at the moment.","score":2,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995087385}
{"content":"Pretty awesome","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9986553192}
{"content":"Its just a farm for ads, and the return is not worth it. Did not even provide me with anything that I'd call comprehensible.","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995059967}
{"content":"Worst applications waste time no signatures I try just waste","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995049238}
{"content":"It wanted me to pay for everything. No demo Paid for subscription. After that, doesn't work. Just blank Wonder title screen is there.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995025396}
{"content":"Loved this app and has used it for almost a year now. I used to to help me create my characters. Whatever yall did to the \"water color\" style you absolutely ruined it. I'm devastated.","score":2,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994958639}
{"content":"They have done alot of work on the app recently, well done...","score":4,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.998875916}
{"content":"Bakwas","score":1,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9878656268}
{"content":"Paid my money for pro (no ads, no que) In 2022. Revisited in 2024, now they want me to watch ads to create. And they are refusing to fix the problem. Theft.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994773269}
{"content":"Good fun","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9987861514}
{"content":"Will not let me restore","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9994812608}
{"content":"It can make some great images, and before I paid weekly and it didn't cap me. Now they have me paying weekly for 50 and then charge me to make more. If I pay for the weekly it shouldn't be caped. Not worth the subscription service. If you pay for yearly they probably do the same thing now. Avoid","score":2,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995087385}
{"content":"I absolutely love this app but unfortunately after multiple attempts to resolve issues restoring my account after switching devices, which they advertise, and the fact that they changed the parameters of how the pro account works, again which they advertised as unlimited, I can only give a 1. Please be honest and upfront about your product as you are upsetting multiple customers by changing and not honoring what you are selling. False advertisement and no business morals!","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9995087385}
{"content":"shame on you... this app is just for mony","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994639754}
{"content":"Nice","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.997769475}
{"content":"good strong engine","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9987700582}
{"content":"Its not free its make then excepted","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9938181043}
{"content":"Excellent!","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9986380935}
{"content":"Its lagging when I'm trying to use the app :unamused_face:","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995054007}
{"content":"Tried to do an ai photo... didn't look ANYTHING like me, and I had 3 ears 2 noses the background was TERRIBLE and blurry... I tried twice both sucked.. not worth downloading","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995027781}
{"content":"1 star because I purchased the life time option and I can't \"Restore\" it on my new Tab S9. Emailed support and their response was for me to use the \"Restore\" option, which I had clearly stated wasn't working, so I emailed them again reiterating my issue and no response has been received (they replied almost immediately to my first email, it's now been 4 days since my 2nd email was sent: 4\/16\/24).","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995080233}
{"content":"Ads ads ads","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9961695075}
{"content":"Chutu app","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9834215045}
{"content":"habahdjalhal","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9951488376}
{"content":"One of the best app i have used","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.9987849593}
{"content":"Trash don't download","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.9986923337}
{"content":"I love this app","score":5,"reviewCreatedVersion":"4.4.7","sentiment_type":"POSITIVE","sentiment_score":0.998890698}
{"content":"Spam","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9992450476}
{"content":"Useless app don't waste ur precious time and money","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.999489069}
{"content":"Very bad app. Because there has so much ads. So, this app is not comfortable for me ans others.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995040894}
{"content":"Very bad.","score":1,"reviewCreatedVersion":"4.4.7","sentiment_type":"NEGATIVE","sentiment_score":0.999483943}
{"content":"I used to like this app. Now it won't even load for me. Kinda horrible since I paid for the full version. Feel ripped off by yet another app that doesn't care about their customers smh.","score":1,"reviewCreatedVersion":"3.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995026588}
{"content":"Perfect.","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9985955358}
{"content":"Don't waste your precious time downloading this app","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994841814}
{"content":"Half the time it generated images entirely unrelated to the prompt.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995014668}
{"content":"This used to be an incredible app. They made some changes and it's just not the same. Good in THEE very beginning","score":2,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.990514636}
{"content":"Good so far","score":4,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9985941052}
{"content":"I want to unsubscribe and it will not give me an option. I want to find out how to remove this app.... I hate how things are today now I have to pay for something because I don't have time for it. Just great.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994727969}
{"content":"For some reason it logged out and I keep clicking that I've already bought the pro version (for $25 for life) and it acts like it's loading but keeps going right back to the \"go ahead and pay\" screen. Maybe I'll try again later. My previous review stands below. It's so fun and sometimes very psychedelic. the images it creates make me think. it's almost like a computer trying to understand us makes me try to understand the computer. give it a try.","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9909285903}
{"content":"SCAM!! DO NOT USE ! Paid 25$ at launch and now they come out with the \"pro\" version and want me to watch ads... Total bs.","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995055199}
{"content":"Extraordinary","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9985609651}
{"content":"Paid for it like a dummy. Upgraded phones and it would not restore my membership. I've contacted support numerous times to no avail. Don't get scammed. There's no support for the app","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995068312}
{"content":"I love how easy to app is to use. I'm also a fan of the designs and other options for sharing. I do not like how I am limited to how many images I can create per day as a subscriber to wonder","score":4,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9987103939}
{"content":"Can no longer get my lifetime account back. THEY ARE TOO AFRAID to actually have a conversation with you on how to get it back. Don't spend any money on any of the subscription because they won't lift a finger to help you get it back if anything happens to your phone the subscription is tied to.","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995037317}
{"content":"Awesome app","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9986573458}
{"content":"Lifetime subscription is only for the lifetime of your phone. Say goodbye to it after you change phones. They'll tell you to use a nonfunctional restore button in a form letter, it doesn't work.","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.999489069}
{"content":"amazing :clapping_hands:","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9980894923}
{"content":"I purchased the lifetime subscription, but I still have to pay for credits in order to use the app.","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.993082881}
{"content":"Wasted so much of my time on making ai picture of couple. I would select 10 images, then it'd say, select three more, I'd have to scroll everywhere, choose again, both the times: for me, and my partner. It then said pay to get it??? Like I literally spent 15 minutes...","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995077848}
{"content":"I don't want to watch adverts when I do art","score":3,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9958648682}
{"content":"Please refund my money fake app","score":3,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994003773}
{"content":"Must have.","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9985764027}
{"content":"I love it?","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9987340569}
{"content":"Nothing I clicked on worked","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994511008}
{"content":"Sucks and will charge you at the end! They will aloud ypu to use bit will want you to pay for it. Plus is too much work to even get to the payment process. No thank you!","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995024204}
{"content":"This app is amazing :clapping_hands:","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9986825585}
{"content":"done has best results","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9955351353}
{"content":"Love the app","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9988725781}
{"content":"Fun app","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9987214208}
{"content":"great for album covers","score":5,"reviewCreatedVersion":"4.0.0","sentiment_type":"POSITIVE","sentiment_score":0.9983002543}
{"content":"Good","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9984152317}
{"content":"SCAM! Paid for a lifetime subscription, it expired, I'm still alive :skull:","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9993816614}
{"content":"Used to be better, occasionally gives you a good looking result but rarely sticks to your prompt and gives you what you ask for","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994968176}
{"content":"I paid for a lifetime unlimited pro, and they took the unlimited away. I FEEL SCAMMED! Maybe a class action lawsuit?","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.999458015}
{"content":"It's a interesting app sometimes it creates nightmare fuel lol. Also I tried to do the couple avatar thing and the avatars don't look anything like me and my bf. Lol","score":3,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9972192049}
{"content":"Similar issue to other people, my phone died and this company is not providing anything but automated emails to restore the lifetime access. I paid more for this access than I've paid for any other app and it won't transfer to a new phone despite them promising that it does. I'm planning on reporting this company as fraudulent to Google play to see if there is anything that can be done. Loved the app, but they don't care about lying about lifetime access.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.999505043}
{"content":"Paid for premium \"lifetime\" subscription. When I changed phones I couldn't restore the purchase... That's some BS","score":1,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9993870258}
{"content":"I only have had this app for 5 minutes and I already love it, two thumbs up, more if I had them!","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.998847723}
{"content":"First review was 6\/24\/22 n I loved it, same as everyone else bought the premium lifetime subscription. Now even if they already got your money there's more to pay for and I can barely get the app to run in the first place, why would I pay money for an app that doesn't work","score":2,"reviewCreatedVersion":"4.1.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995082617}
{"content":"The program appears to be user-friendly, however, it is somewhat misleading as the full version still requires additional credit purchases after a limited amount is provided upon sign-up. While I understand the concept of optional ad viewing for a $30 full version purchase, I find it concerning that further payments may be necessary after the initial investment.","score":2,"reviewCreatedVersion":"4.4.5","sentiment_type":"NEGATIVE","sentiment_score":0.9979764819}
{"content":"very interesting app","score":5,"reviewCreatedVersion":"4.4.5","sentiment_type":"POSITIVE","sentiment_score":0.9983925223}
{"content":"Nice useful app","score":4,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9986945987}
{"content":"I sent question to help me. I paid for lifetime and restore doesn't work I do get a standard mail to press that same restore button. Fix my lifetime paid account .","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9989443421}
{"content":"It really a cool app.","score":4,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.998694241}
{"content":"Refund my lifetime subscription that I can no longer use. I am tired of getting no assistance from your useless customer support. Codeway is a FRAUD.","score":1,"reviewCreatedVersion":"3.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994976521}
{"content":"Like others I paid for the lifetime Pro, I switched phones and it won't let me restore. Send out multiple emails I also got the automated responses.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994940758}
{"content":"it just doesn't create anything the way you describe it. Microsoft is way better","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995009899}
{"content":"I watched 4 ads, can't see my picture, it feels like ai server is not working and the app turned into a cash grab trap.","score":1,"reviewCreatedVersion":"2.2.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995092154}
{"content":"my submitted faces always hard multiple noses and mouths","score":2,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9732581377}
{"content":"This app is sh**","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994833469}
{"content":"Was gonna try this but their really isn't a basic free on this. After a certain time it will charge you so I'm not gonna do it at all. Skiped this app big time","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995082617}
{"content":"I liked the service enough to pay 30$ for a lifetime subscription that can be used across multiple devices. I tried to use it on a second device and the restore purchase option doesn't work. The devs won't address my issue after a couple weeks so I'm changing my review. Used to be 5 stars...","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994359612}
{"content":"garbage","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9993858337}
{"content":"I take 50$ for one review thanks for helping me","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9967784286}
{"content":"Wow, best app ever, and I rarely give such excellent reviews on apps...","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9987998009}
{"content":"This app used to be awesome. I figured they would've fixed it by now, but nope! This app sux now. Don't waste your time or money.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995130301}
{"content":"Asked for a Refund ai generated response you can never switch between devices you lose money Hello, We hope this message finds you well. We would like to express our appreciation for the valuable feedback you've shared with us. We're grateful for your contribution. Rest assured that we have taken your feedback into consideration and will be working on it. Your thoughts help us enhance the experience for all our users. Thank you for being a part of our community. Kind regards, Wonder Team","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9966379404}
{"content":"I paid for premium on this product a couple of years ago for a lifetime subscription. When I transferred phones I couldn't get the subscription to transfer over after trying the steps in the app. I contacted customer support and they just told me the same thing in the app. I would stay away this company does not care about their customers experience. You might use the free version but do not pay for premium because they do not stick behind the lifetime subscription.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995071888}
{"content":"RESTORE BUTTON DOES NOT WORK. Got a new phone after paying for the lifetime subscription and Wonder will not restore my purchase access. I've contacted support three times and each time they respond telling me just to click the Restore button THAT DOESNT WORK. FIX IT OR REFUND ME. sick of this.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995009899}
{"content":"my favorite AI art app","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9983713031}
{"content":"Bought new phone: refused to respond to me about restoring my premium account on the new phone.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995001554}
{"content":"Updated - they have added a lot of cool new features, but they ainis starting to struggle with basic details again as well as the art type rendering poorly or incorrectly since the last update. I also switched phones and cannot restore my premium. Staff never responds. __________ Fantastic art very buggy. I paid for premium at the start of the year and I love it. However as it's updates it begun to have more bugs and errors out some days and won't generate anything. Staff never responds","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995080233}
{"content":"SCAMMERS! Did buy the pro version for lifetime a year ago, but now they locked me out and I can't access to the PRO version!","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994949102}
{"content":"Trash app, don't waste your time or money. NSFW filter censorship is beyond ridiculous. It will not allow you to prompt any sort of injury. I understand nudity, but wounds? Come on.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995057583}
{"content":"This app appears to be broken now. I have a pro subscription and now it's not recognising my paid account. Disappointed :frowning_face:","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995086193}
{"content":"Purchased unlimited, but now I'm limited by credits. Bait and switch to us early adopters who funded you.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9993892908}
{"content":"Your support is awful! I switched phones. Clicked Restore to get my permanent access back and NOTHING happened. I emailed support multiple times and just got the stupid form letter telling me to click restore....IT DOESN'T WORK! How do I get an actual person!","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995090961}
{"content":"This app can't transfer to a new phone - Garbage company, use a different app.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.999484539}
{"content":"Zero customer support, don't expect help after they steal your money. Paid for the lifetime and got a new phone. Restore button isn't working at all, no matter what I do. Re install, reboot, delete, etc... email support and just get a canned response on how to get to the restore button WHICH DOESN'T WORK... so I guess lifetime means until you delete the app or get a new phone. I'll be letting Google know about this, and hopefully they'll be able to get this company to actually fix!","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995111227}
{"content":"Horrible not what they advertised !!!","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994959831}
{"content":"it's fun so far","score":3,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.998668313}
{"content":"I bought Wonder Pro a long time ago and now I'm hitting daily limits? Scammers","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994704127}
{"content":"I had to get a new phone(same as my old) and the app won't let me restore my lifetime wonder pro purchase","score":3,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9993543029}
{"content":"paid 40$ for the app now it wants me to pay again and the restore button doesn't work","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995027781}
{"content":"Edit: Had issues after I reset my phone with reinstating my license. For anyone with the same issue contact them through their discord server, not their customer support email. They resolved it in a few days and now I'm back to making awesome ai art!","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9979288578}
{"content":"doesn't allow nsfw pics but there are work arounds","score":4,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9947572947}
{"content":"UPDATES: minus stars! The 1st avatar 100-pack I paid for NO-showed - it showed 5 min left, then no sign of results at all! So, 1 more try is in progress, supposedly. Because I'm that curious. Hours later: only 1 pack showed up (paid for 2). WAS 5-STAR because it seemed fun: Of course, I life-subscribed, but I lost that too when my phone died (not me) and I had to replace it. So I was cheated twice!","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995039701}
{"content":"need more aspect ratio to create 4K image","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9933920503}
{"content":"Not a single week free trial before payment. How can customer get sure about quality and work ?? Uninstalling it right away.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994971752}
{"content":"Hate that I have to do this:unamused_face: this app had so much potential but I'm not gonna pay a 2nd time to run it on another phone after paying for lifetime purchase. READ REVIEWS alot of people like me don't like leaving bad reviews but seriously don't give them your money","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995144606}
{"content":"This app is glitchy and closes out. This last week the \"no style\" option is gone and faces are ugly. Too bad because the faces use to be beautiful. Please change it back.","score":2,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994852543}
{"content":"I used to like this app a lot, but when I upgraded to a new phone, I could not restore my lifetime Pro access. I contacted support 4 times! I received 2 identical automated responses that might work in many cases, but not mine. I have explicitly requested twice that they contact me to help me restore access, but no one has responded. Do not bother with this app. There are plenty of other AI art apps. The restore button doesn't work. Uninstalled. Wonder sucks!!!!!!!!!!!!!!!!!! Keep your money.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995108843}
{"content":"I downloaded the app when it first came out as it was highly recommended. I purchased the Pro version right away and the app has been great. Recently though there has been a limit to the # of creations I can do a day, even though it advertises as unlimited. Contacted their Customer Service which said they've had to put a limit on the pro version, and that you can purchase other packages to allow more creations. Which you can't. And the app still shows unlimited creations for pro. Lame.","score":2,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.998139739}
{"content":"Waste of time and waste of money","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.999476254}
{"content":"It's a nice app, especially when creating a promt","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9987069368}
{"content":"Deceitful and expensive","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.999463141}
{"content":"It has been an hour, and it hasn't finished loading the avatars.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994626641}
{"content":"GreT app","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9469192624}
{"content":"Pretty distasteful of showing a picture of Jesus the Son of God and God in the flesh, with tattoos thats rude.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994843006}
{"content":"Awesome","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9986000657}
{"content":"After downloading I tried to use the app but it forced closed Everytime. I give up. Zero stars if I could. I never even got to make a picture.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995064735}
{"content":"Look, it's a nice app, but the end result of the art is very inadequate.","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995089769}
{"content":"Pay once for lifetime is a lie, and you'll get through the daily limit quickly because most of the images a junk. Since the new updates the resulting images have been horrible, rubbish generic faces, that were stunning before. There is also no consistency within the styles. The same prompts will give totally random styles, so you can't develop your own style like you could before. Gone from my favourite AI app to probably the worst.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.999504447}
{"content":"This app is garbage - DO NOT BUY","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.99949646}
{"content":"wow","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9957777262}
{"content":"If this app can't create memes or comic strips with captioning it's honestly not worth anything..","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995031357}
{"content":"Not free to even try","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994814992}
{"content":"Fake","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9990664124}
{"content":"It needs to stop glitching.","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994544387}
{"content":"Purchased lifetime last year. Got new phone this year and tried to restore my purchase. Would not work. Contacted customer service, they email me step by step instructions on how to restore, which was everything I had already done, still didn't work. I informed them of this and they have not responded in over a week.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.999494791}
{"content":"Try the signature....LOL HORRIBLE... it was so bad I didn't want to try ANYTHING else...","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995003939}
{"content":"I bought this a while ago. After the update, they have removed my access.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9993345141}
{"content":":star-struck:","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.995143652}
{"content":"Photo generation sucks, doesn't actually generate what youre asking for and ads everytime you create a new image even if the output was complete garbage the first time. So many ads.","score":1,"reviewCreatedVersion":"4.0.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995061159}
{"content":"Beautiful art and æsthetic design :smiling_face_with_heart-eyes:","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9986541271}
{"content":"love it","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9987894893}
{"content":"Kinda disappointed my lifetime membership doesn't include wonder Pro which appears to be online exclusive","score":4,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9978354573}
{"content":"Sad to report after having to upgrade my phone, the app refuses to acknowledge the lifetime package was already purchased and refuses to allow you to try to log in with a different Google account once you've already selected one. It worked as intended at first, but trying to recover my purchase and getting back to my account has been an awful experience.","score":2,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995099306}
{"content":"amazing artwork created in the palm of your hand.","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9987717271}
{"content":"First review 10\/22: So cool! Loved it so much, I immediately paid for lifetime. Only thing that could make it perfection would be for the AI to make an image utilizing words or phrases. Edit 3\/24: Changing to 1 star because after the forced update, it will not restore my lifetime purchase. The restore button has never worked. Crooks!!!","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994834661}
{"content":"Removed 2 stars because this app is getting frustratingly difficult to use. I keep getting flagged for NSFW prompts when I'm not attempting to describe anything remotely NSFW. Good luck trying to craft anything beyond the most basic of prompts. Also, the editor never works for me so it's impossible to tweak the results I do get. I loved this app, but recently it's just frustrating. March 2024: Removing another star because I paid but it is capping my daily use. Wonder sucks.","score":2,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995093346}
{"content":"Restore purchase does not work I am not going to buy this for the 3 time","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995046854}
{"content":"I look forward to updates as the AI continues to increase in power and realism.","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9987844825}
{"content":"IT DIDN'T DO ANYTHING I ASKED IT TO DO. IT JUST DID ITA OWN THING THE ENTIRE TIME. DONT DOWNLOAD IT.","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995005131}
{"content":"Every time I attempt to generate an image, I become the captive audience of a playable ad for an asinine mobile game called \"My Perfect Hotel,\" which forces you to endlessly clean toilets and change soiled bedsheets for angry customers (essentially my old day job - yay for top-tier gameplay experiences in 2024). There is no \"X\" button or countdown, and clicking the download button does nothing to remove the ad. This has made it impossible for me to generate images on the free version of the app.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994938374}
{"content":"This app has gotten worse and worse to the point I'm honestly starting to believe it's intended to be frustrating. It creates the same artifacts and random additions to prompts over and over again when told not to. About every 4th image is still so riddled with a.i. errors it's laughable. This legitimately feels like it is meant to enrage me by repeating the same mistakes over and over rather than create the image I want. It's ridiculous. Now I'm getting the same issues as other lifetime member","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995113611}
{"content":"just chill","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9984801412}
{"content":"Been using Wonder AI for prob about a year and my experience has been fantastic. I have tried other AI art generators but keep coming back. It sometimes has a hard time understanding what I am describing with certain details\/Prompts, but overall, I have been able to create anything I have tried to, with a fairly high degree of accuracy. I do miss the previous version of roughly 6 months ago, where I was able to more easily generate very realistic images\/people. Still can, tho not as well.","score":5,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9988940358}
{"content":"very detailed but limited for a broke boy but sometimes they get the exactly right","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9958057404}
{"content":"Omg ...downloaded this yesterday...400 images later I want the full version..its great .best app I've got.:thumbs_up::United_Kingdom:ok I've deducted a point a week later..for no response from support about the fact I bought the full version and expected 50+ styles ...mmmm nah dint get ....but I don't even care this is still worth 20 quid .I'd give it six if they respond lol.ok one year ish on...got new phone and can't recover? Help","score":4,"reviewCreatedVersion":"4.4.0","sentiment_type":"POSITIVE","sentiment_score":0.9983639121}
{"content":"this game does not give full truth you have to pay to get visual and it says its free and ads ads ads","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994945526}
{"content":"Everything was fine and I love the app until I got to the part where I actually paid the $7.99 for the package that I wanted and it said to wait for 30 minutes and that the photos were being generated so I waited for 30 minutes and when 30 minutes is up it kicked back over and said wait 30 minutes for the photos to be generated and so on and so on I never received my photos. I would like my photos or a refund if that can be taken care of then I will turn this review around and give a good review","score":1,"reviewCreatedVersion":"4.4.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995051622}
{"content":"I updated it now you need credit if you can a donut update you can trade all the images you like","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9980169535}
{"content":"Rubbish. I brought the pro\/premium for a lifetime access, and it still is telling me I do not have that. What a scam.","score":1,"reviewCreatedVersion":"4.1.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995012283}
{"content":"I love the app, it's actually huge help for me cause I need abstract Images often, and those are high quality. I bought lifetime option, cause that is what I usually use when I find app that I plan to use long term, cause subscription adds up and it is annoying, so lifetime is the way :smiling_face_with_smiling_eyes: I had to update my review to include this, I gotta say how useful the chat bot is, and you get it in the package, I am using it for everything, translation, grammar, cooking ideas, post ideas, everything :smiling_face_with_smiling_eyes:","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9989032745}
{"content":"It is really good but way to slow","score":4,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.980424583}
{"content":"dont install prank app","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994693398}
{"content":"Paid for a lifetime subscription, now it's changed completely to a pay by credits scam. Do not download","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995007515}
{"content":"Does not follow my description at all","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994877577}
{"content":"This is a phenomenal tool for self published authors. I love the uniqueness of the images and the professional presentation","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9989324212}
{"content":"Paid for the app, got a new phone, and am unable to restore purchase and got no response from them about it.","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995057583}
{"content":"It does work. It's just a scam when it comes to buying or subscribing the lifetime option which sucks. All I can say say is if your ever planning on buying the lifetime pass, reconsider because if you uninstall it, it'll never restore your previous purchases.","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994878769}
{"content":"Bought lifetime, changed device but restore option do not work, customer service not willing to help, continues to send me same auto-message!","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995105267}
{"content":"Very cool experience","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9986535311}
{"content":"DO NOT PAY FOR A LIFETIME SUBSCRIPTION! I paid for a lifetime subscription. It quit working, when I upgraded my phone. I cannot get any help despite many emails. Apparently this is a very common problem with this company according to the forums.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995033741}
{"content":"to many advert. so frustrating","score":3,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994828701}
{"content":"Trash","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9984360337}
{"content":"I could not even try. It was stuck in ad that I could not get out from. It. You guys can go f your self","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994995594}
{"content":"Last update has made the app nearly unusably slow. The entire UI is laggy and each keypress in the prompt entry field is excruciatingly slow.","score":3,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995070696}
{"content":"great","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9985584617}
{"content":"Too laggy to generate an image","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994940758}
{"content":"it's been great app but","score":4,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9948044419}
{"content":"I love the app.. I thought it was free because I was not charged for so many creations. After 5 months or so it prompted me to pay for other features. I paid for credits, and now some of the features aren't working at all like song creation. It only prompts you to buy More credits. Please fix! I'm using this app to help write a story .. It needs graphics","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9738034606}
{"content":"I used this app once then uninstalled it. The image I asked it to create not look like I hoped and I didn't want to pay.","score":3,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995025396}
{"content":"Buyers be ware! Lifetime subscription does not allow a Lifetime generation of images, but 50% off expensive in-game packages. This is not an app to have fun with without spending a fortune","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995056391}
{"content":"I bought it long time ago and now I can't restore my purchase!!!!","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.999473393}
{"content":"They wanted money and it got very uncreative in less than three days","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994831085}
{"content":"Just trash","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9989342093}
{"content":"it's a good app to let creativity flow","score":4,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9988903403}
{"content":"Great when it works","score":4,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9961916208}
{"content":"Wonder","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9947821498}
{"content":"I think my imagination is too far out of this world and that A.I. can't keep up with it or it's broken.","score":2,"reviewCreatedVersion":"1.5.0","sentiment_type":"POSITIVE","sentiment_score":0.9863755107}
{"content":"Great app for arts","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9987766147}
{"content":"Bought the app when it first came out so I wouldn't have to watch ads to generate the art. But now they released this \"pro\" version and now I'm forced to watch ads unless I subscribe even though I literally paid for this before it was ever a \"pro\" version. Honestly disappointed","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995036125}
{"content":"This is an amazing APP. I love it","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9989023209}
{"content":"I upgraded to the paid version because often you have to try several times to get an image you want, but after changing phones I'm unable to restore my purchase. My account was restored and old saved images are available but I am back to limited prompts.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994348884}
{"content":"(UPDATE: Issue hasnt changed they still are trying to get more money outta me LMAO) App is def trying to steal more money from me bc everytime I click restore nothing happens. Other than trying to make me pay again for it it's a very nice app deserve 5 but this issue is extremely frustrating.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995108843}
{"content":"Create things, creatures, and people that you just know they are hopelessly flawed somewhere.","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9912326932}
{"content":"Used to be an above average ap. Now a complete scam","score":1,"reviewCreatedVersion":"4.0.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995017052}
{"content":"love it","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9987894893}
{"content":"(pro subscriber) used to be great. The modeling is good but the keywords have been neutered so bad that the word \"person\" is being flagged as NSFW. I can't get anything to work anymore","score":2,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995062351}
{"content":"Right now it is having issues where it won't get past the wonder title when it loads up other than that when it works I really enjoy using the software.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9986373782}
{"content":"Bought the lifetime, keeps asking to buy again or plays advertising. Restore doesn't do anything. When it was working fine it was pretty fun. It's working again. Changed to 4 stars.","score":4,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9988493919}
{"content":"Great, so far, just started. will give feedback as I learn more.","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.998682797}
{"content":"It does not work canceling","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994623065}
{"content":"Updated- still super lame. Would actually give it a star but it won't let you restore a lifetime account and there is no customer service. After numerous emails and no response, here's where we are. There are way better AI out there that are free. . Original ppst- The pro purchase is a scam. There are not 50+ styles, just the same styles that are there for the free version. I wasted the $24 on pro and it's no different at all.","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995068312}
{"content":"Its a great app, but way too much censorship. They put a muzzle on creativity. I uninstalled it because I understand that AI can provide the ultimate creativity tools, but obviously it is designed for children. I am in disagreement with this because kids need to exercise their own brains before surrendering their creativity to AI.","score":3,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994858503}
{"content":"I paid for their services, and now, without warning, they implement a credit system, making my almost $30 obsolete since I can't use the app as much as I want. They're being a greedy company and changing their service conditions, and ripping off their customers.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995036125}
{"content":"cool","score":4,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.996170342}
{"content":"I think it's stupid I have to pay for and create an avatar keep your app I don't want it","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994906187}
{"content":"The images come out better and more to taste than any other AI program style I have tried. however they charged me for 50 avatars and they never processed. my rating will go up once this is resolved. Also any purchases on premium are only honored on the device you purchased it. If you lose, change, or switch phones you lose the money you used to purchase whatever premium package you purchased. I bought the lifetime, and now I am losing full access to what I paid for, and they will do nothing.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9990136623}
{"content":"Don't use unsafe words like Muscular Male Japanese Or Artwork","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9982466698}
{"content":"The app is quite interesting. I've been using it to gain a visual representation of characters I'm writing, and it has been most useful! I did opt for the pro subscription as the ads are rather annoying. While I do love the results of this app, there are two glaring issues that need to be addressed. The first is color. If you ask for different colors on different objects, it spreads the colors randomly and in the wrong place Second, humans aren't supposed to have 3 legs or 2 hands to an arm.","score":3,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9959959984}
{"content":"It cost to use no thank you","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9988709092}
{"content":"Happened again. New phone, same issue! I purchased the full lifetime ad free pro version of this when it first came out, now they are trying to get me to purchase the pro version again because I got a new phone and making me watch ads before I create. Bait and switch scam. I want a full refund!!","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995079041}
{"content":"it's so slow I won't even let me type","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994916916}
{"content":"Love this app , but some options in the app are a bit expensive","score":4,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9988646507}
{"content":"I have proof that I bought the lifetime premium version on 12\/12\/2022 the app won't allow me to restore my purchase how can I get refunded? The total charge was $32.46...","score":1,"reviewCreatedVersion":"2.4.3","sentiment_type":"NEGATIVE","sentiment_score":0.9992027879}
{"content":"Good until you run out of credits. And I'm not paying for more.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9980443716}
{"content":"No customer support, falsely advertising the lifetime subscription, scams you outta money if you change devices after purchase even if linked to the account you make, waste of your money don't get the app there's better out there","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995069504}
{"content":"Like this app so much last time I used it that I just downloaded it to my newest device","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.99874264}
{"content":"The app is decent in its design prompted art BUT every 3 rd pic the app boots me and shuts down. It has done this numerous times. It is very frustrating to continually start over, not to mention I loose my picture credits each time as well.","score":2,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995088577}
{"content":"Great app!","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9987770915}
{"content":"Too restricted, lifetime membership no longer worth anything","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994620681}
{"content":"Pretty great app, just a small critic. When I say I want purple eyes, I mean purple eyes. Now purple hair, not purple clothes, no purple super powers. Purple EYES. This happens a lot.","score":4,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9985817671}
{"content":"Changing to a 2. I paid for the lifetime and switched phones. I have contacted support. I got AI ironically, and they told me to hit the restore button. When I explained that the restore button didn't work, I have yet to receive a response. Made cool art and stole my money.","score":2,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994937181}
{"content":"Very nice app i love this it is just perfect :red_heart: recommend that you should be download this app :grinning_face_with_big_eyes:","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9989006519}
{"content":"None of the prompts give you what you want. Not even close.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994621873}
{"content":"Pro membership not working. No response from customer service. Watching ads suck when Ive already paid for the service Still not fixed 2\/28\/24","score":1,"reviewCreatedVersion":"3.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994955063}
{"content":"this app is awesome :OK_hand:","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9986049533}
{"content":"Sometimes fail to work. Generates distorted or multiple arms or legs and the developers seem too concerned with policing users than giving a great app.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995052814}
{"content":"Generally good, but would be better to have more real photo format","score":4,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9985174537}
{"content":"Very bad customer service. 2 days and no response to email.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995111227}
{"content":"Funny","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9974065423}
{"content":"I was doing pictures and then the thing I asked for was always a tattoo","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9988388419}
{"content":"Bought this app and it was great then I got a new phone (Android to Android) and now it's making me repurchase it. I hit the restore button and nothing happens. They false advertise that you'll be able to restore it. I emailed support and I got an automated response just telling me to hit the restore button :upside-down_face:","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995056391}
{"content":"Cool app","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9985405207}
{"content":"Loved app for a long time. I have had the paid lifetime subscription since before there was a daily limit on creations. This means I still have no daily limit. Now, it seems like they are trying to get out of that deal. I am hardly ever able to get loaded into the app, and on top of that, when i do get into the app, the option to save an image as high quality does not work. If this is an error, then fine, but I want to see it fixed. If not, then I'd like my lifetime subscription refunded.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995108843}
{"content":"I Purchased the app for lifetime but it doesnt recognize it anymore! 0\/10 DONT WASTE YOUR MONEY!!!","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995042086}
{"content":"Since the recent update prompted creations often show as a black screen. Nearly every photo uploaded to create a similar photo are frequently rejected and labeled as NSFW. A photo of my friend eating pizza is not NSFW. Paid subscription, unable to use in the way you advertise.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9990568757}
{"content":"What happened :confused_face: this app used to be so good when the generated art didn't look so washed out when the imput information made the most interesting versions of an image now its all nsfw blocked when face app was able to put faces on images I used to fix the ai generated imagery myself now it's just another pointless app there's nothing interesting anymore. After so many uses now after everything having been changed has fallen from my praise there's just no point anymore...","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995126724}
{"content":"Hands down still the best AI Photo rendering app since inception, turn key operating and effective for all users experienced or not.","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9988176227}
{"content":"Simple to use and fun!","score":5,"reviewCreatedVersion":"4.3.5","sentiment_type":"POSITIVE","sentiment_score":0.9989027977}
{"content":"It won't restore my lifetime purchase from this account when I upgradey phone and clicked restore I also emailed support all it did was tell me to click restore which I tried already.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994980097}
{"content":"This app is big time tight! I've made the coolest original art with descriptions like horror,3D,tattoo,color I can change any drawing into something wild A.f!! You gotta try it. To use free hit the x at time of payment and agree to watch ads. And check out my killer reels on fb profile Karl Fuszner\/PIKSTORIES,:star::star::star::star::star:","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9987112284}
{"content":"Wouldnt take my prompts. Also requires a trail to function","score":3,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995024204}
{"content":"I used to love an older version of this... now it tells me I can't generate things or it turns out a plain black image... I tried to report a bug, but the email us option tells you to email them if there are any issues.... maddening.... tell me again how this is what I paid for?","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995088577}
{"content":"I liked it while it worked. I paid for the premium subscription but it stopped working. Email to their support address results in an automated message telling me to try to recover my subscription. Further emails to them go unanswered.","score":1,"reviewCreatedVersion":"4.3.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994965792}
{"content":"excellent.im really enjoying this app","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9988809228}
{"content":"Checked","score":1,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9959347248}
{"content":"The pro version has not been activated for me after payment, even after I sent my complain to support team, and I followed by another email with payment reciept.","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.999505043}
{"content":"Bought the whole program but has started rendering garbage, have rendered 1000s of images but as of the last month really started rendering weird and ugly things. Big disappointment, sucks that it was good but now garbage","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995075464}
{"content":"App has been working great since the newest update","score":5,"reviewCreatedVersion":"4.3.3","sentiment_type":"POSITIVE","sentiment_score":0.9988508224}
{"content":"Ridiculously slow .","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9993876219}
{"content":"Its ok for the free version","score":4,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9880741239}
{"content":"Scam cant restore purchase","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994669557}
{"content":"love it","score":5,"reviewCreatedVersion":"4.3.3","sentiment_type":"POSITIVE","sentiment_score":0.9987894893}
{"content":"Paid for the pro version and they started shirking on the amount of pictures I can generate per slide they are a scam","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994914532}
{"content":"Best AI image generator!","score":5,"reviewCreatedVersion":"4.3.3","sentiment_type":"POSITIVE","sentiment_score":0.9976125956}
{"content":"I already bought the lifetime version, deleted the app because I got bored, download it again and am being bombarded to buy the lifetime plan or ad waterfall again. App is a scam.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994965792}
{"content":"Bought the app in 2023 since then the censure got so aggressive that some results are just black screen. Iff you want bikini shots this app is not for you.","score":2,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995062351}
{"content":"Great :thumbs_up:","score":5,"reviewCreatedVersion":"4.3.3","sentiment_type":"POSITIVE","sentiment_score":0.9988106489}
{"content":"I love this app:star:","score":5,"reviewCreatedVersion":"4.3.3","sentiment_type":"POSITIVE","sentiment_score":0.9988378882}
{"content":"Paid for pro for lifetime, got a new phone and it won't restore my purchase!!!","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994491935}
{"content":"Great to work with. Works best if you upload something close to what want.","score":5,"reviewCreatedVersion":"4.3.3","sentiment_type":"POSITIVE","sentiment_score":0.9987181425}
{"content":"Ai art will never be real art Ai art will never be real art Ai art will never be real art Ai art will never be real art ( I only download the app to leave these review suck a fat one)","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.999143362}
{"content":"Love this App","score":5,"reviewCreatedVersion":"4.3.3","sentiment_type":"POSITIVE","sentiment_score":0.998850584}
{"content":"Moves like a snail. A paywall to use the app. No thanks.","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994926453}
{"content":"Pretty awesome app. Only annoying thing is you removed the filter called \"Halloween\" which I really liked using to make creepy images. Please bring it back!","score":4,"reviewCreatedVersion":"4.3.3","sentiment_type":"POSITIVE","sentiment_score":0.9987591505}
{"content":"nice work","score":3,"reviewCreatedVersion":"4.3.3","sentiment_type":"POSITIVE","sentiment_score":0.9987094402}
{"content":"Was great until I swapped phones. Restore function does not work on new phone. Emailed 3 times and received a copy\/paste response telling me to click the restore button despite my message in the ticket saying the restore function doesn't work. Absolutely terrible, non-existent support.","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995077848}
{"content":"get nothin free","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9906895161}
{"content":"I paid for the pro version and then lost my old phone. The pro version won't \"restore\" on my new device even tho I was able to log into my account. I've tried reaching customer service but it's impossible to email a human, only automated messages. Because it's been over two years since I bought the app originally, Play Store refuses to refund me. I'm not paying twice, for the same app because my phone was stolen. There are way better free-to-use AI imaging apps out there anyway.","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9994914532}
{"content":"The image genaration isn't great to begin with. Also I upgraded to premium just because it was supposed to be a one time purchase but when i got a new phone, Wonder doesn't recognise me as a premium user","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.999478519}
{"content":"Does not generate based on the prompt","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994915724}
{"content":"SO BAD","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994303584}
{"content":"Highly disappointed. I paid for the lifetime membership not even a year ago, and it keeps asking me to buy the membership again. DO NOT SPEND THE MONEY IT'S A SCAM!","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995055199}
{"content":"Not free!!!","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.996519804}
{"content":"Tldr, if you buy this on your phone and then upgrade that phone to a new device, you no longer have access. Paid the one time fee for the full service on my last phone, turns out it's device specific so now that I have changed phones I no longer have access to that purchase. Contacted customer support and they told me there's nothing that can be done.","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.999358356}
{"content":"Bought the lifetime pro almost a year and a half ago, now saying I don't have it and wants me to pay again. The free version is clunky, limited, and takes too long to generate anything due to ads. Will not be using anymore. Don't waste your time or money on this.","score":1,"reviewCreatedVersion":"4.1.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995031357}
{"content":"Really not impressed, first of all, i have to click twice of thrice on everything! Never responds in one click. Secondly, i have to wait ridiculous amounts of time for anything, like no im not going to wait 1000 hours for the app to load. Shoves you in the face with an advertisement for the pro which with the aformentioned problem does take quite a bit of clicking to get rid of. Only redeeming quality it that the interface is nice.","score":2,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995133877}
{"content":"The app is stuck on the loading screen","score":1,"reviewCreatedVersion":"4.3.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995001554}
{"content":"So far I love it. It's straight forward and allows me to create visuals I can integrate into my work as a blogger and website content designer.","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9989307523}
{"content":"Takes forever to load the pics, unable to delete your account. They just sign it out, they don't actually delete it.","score":1,"reviewCreatedVersion":"4.3.1","sentiment_type":"NEGATIVE","sentiment_score":0.999497056}
{"content":"I paid to buy the app for unlimited use, and now it's limited? Refunds should be issued to us that paid, this is ridiculous.","score":1,"reviewCreatedVersion":"4.3.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995054007}
{"content":"I don't know why the app keeps taking my money when I don't have the app anymore and am not Subscribed anymore but y'all still take from my bank account fix. it and give me a refund","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994469285}
{"content":"You bait and switch bastards, I paid for the lifetime BS, and then I got a new cell and my unlimited tries is GONE. Now I have to pay for credits. It's no longer worth the money if you're thinking of getting this app, don't bother","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995065928}
{"content":"Very good","score":5,"reviewCreatedVersion":"4.3.0","sentiment_type":"POSITIVE","sentiment_score":0.9986018538}
{"content":"I paid for lifetime. What happened to lifetime subscription? Now I see credits.","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9976720214}
{"content":"I had a lot of fun with this app but there's seems to have been an update to the algorithm that's made it less freaky and weird","score":4,"reviewCreatedVersion":"4.3.0","sentiment_type":"POSITIVE","sentiment_score":0.9939152598}
{"content":"Save your money, and look for a better quality app, this one sucks so bad, i don't have the time to explain it.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995094538}
{"content":"very well :mending_heart:","score":4,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9985877275}
{"content":"Actually really good image generator my only complaint is the short tickets per day","score":4,"reviewCreatedVersion":"4.3.0","sentiment_type":"POSITIVE","sentiment_score":0.9987285733}
{"content":"I can not do anything without buying the pro version don't get this app.","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995038509}
{"content":"it's slow :pensive_face:","score":3,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9983041286}
{"content":"great app","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9986988306}
{"content":"This is a scam! I paid for lifetime and now they want me to pay for credits!:enraged_face: This was my favorite app but I won't use it again!","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995039701}
{"content":"Much has improved since my first review of the app, better image quality, more avatars and a chatbot, however this app desperately needs a dark mode so users don't get blinded","score":4,"reviewCreatedVersion":"4.3.0","sentiment_type":"POSITIVE","sentiment_score":0.998067677}
{"content":"first time I've used AI. I love it!","score":5,"reviewCreatedVersion":"4.3.0","sentiment_type":"POSITIVE","sentiment_score":0.998883903}
{"content":"Great","score":5,"reviewCreatedVersion":"4.3.0","sentiment_type":"POSITIVE","sentiment_score":0.9985885024}
{"content":"Not worth the time.","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994879961}
{"content":"It changed the facial images beyond recognition","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9950304031}
{"content":"Takes up a lot of spaces","score":3,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.99943012}
{"content":"Fun game","score":5,"reviewCreatedVersion":"4.3.0","sentiment_type":"POSITIVE","sentiment_score":0.9988071918}
{"content":"Nah this thing is weird as hell I tried to do something and it wanted to go in my photos and I didn't let it and went back but when I tried I saw it change my screen and accept the photo thing without my will","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9986543655}
{"content":"Couldn't load images at all.....nothing seemed to work on the app. Irritating!!","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995082617}
{"content":"I tried to use the signature feature and it spelled my name completely different than what I told it to. The ai struggles with faces. I had to try many many times before getting an imagine without the eyes being deformed.","score":3,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994741082}
{"content":"DO NOT DOWNLOAD THIS APP I paid for the lifetime package and the app will not allow me to restore the purchase","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.99949646}
{"content":"does alright sometimes goes off into left field, edit, new update killed it as they now censor anything Promt wise that they deem close to NSFW even thou some of the images still come up \"mature\" without you even being close to trying for something like that.","score":1,"reviewCreatedVersion":"4.0.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994551539}
{"content":"Unfortunately I give this 2 stars because it is SUPER slow and glitchy and if you don't pay you have to watch a ad to generate a picture it looks super advanced but in reality it is a little bad it needs work","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995130301}
{"content":"I paid for the lifetime subscription on this app and I cannot restore the purchase most upsetting","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994764924}
{"content":"I love using this app the results are amazing and most if not all of the glitches and distortion has been fixed, I would highly recommend using this app for your profile pictures, gamer pics and wallpapers. But I wouldn't recommend buying pro if you're looking for a fix to your dislikes of the app. Update up to now it's been good but now I'm lagging a lot and I could no longer publish anything so now I have to download all the results that I like","score":4,"reviewCreatedVersion":"4.3.0","sentiment_type":"POSITIVE","sentiment_score":0.9987280965}
{"content":"Like another said, Paid for LIFETIME membership only not to have it on a NEW PHONE. This is Totally bs on a company side. 1 star until you give me back what I paid for upfront!","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995033741}
{"content":"Not really happy....originally I enjoyed this app, so I paid a one time fee to be permanent. Had to get a new phone & when I went to re-download, relogged in & everything it refuses to Restore my purchase, no matter what I try to do.","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.999510169}
{"content":"Recently purchased avatar pack. My bank account was hacked shortly after. Beware.","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9992613196}
{"content":"I paid for the lifetime version of this, then six months later they changed everything and now my login doesn't work. I have contact support 10 times 3 different ways, and they always give the same story about clicking the new \"restore\" button. It doesn't work. Then they ghost me and stop replying. Con artists, stealing money if you ask me. And it's nowhere near as good an app as firefly or Dale or nightcafe anyway.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.999504447}
{"content":"acertados con las imágenes","score":5,"reviewCreatedVersion":"4.3.0","sentiment_type":"POSITIVE","sentiment_score":0.994184196}
{"content":"Takes your money and crashes then wants you to pay again. Still haven't gotten the pics I paid for on top of the subscription it wants you to buy.","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995040894}
{"content":"all I can say is it's wonderful","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9985900521}
{"content":"The subscription is device specific asks can't be shared with family members. I would not recommend.","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994787574}
{"content":"**ZERO STARS** I upgraded my phone and tried to restore my lifetime purchase on my new phone and it didn't work. I tried emailing them to restore my purchase or give my money back and I get an automated email walking me through the restore process that doesn't work... EVERY TIME I try to email them. There's no one to contact and I lost my purchase of this app. RIP OFF! DO NOT DOWNLOAD!","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.999510169}
{"content":"Amazing","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9986121655}
{"content":"I can't even try it out unless I give you my credit card information first? No thanks.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995051622}
{"content":"My app will not restore my premium account I paid $35 for... I'll change my review if they assist this issue..","score":1,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994357228}
{"content":"Not free its a scam you have to pay to get unlimited images waste of data!","score":1,"reviewCreatedVersion":"3.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994685054}
{"content":"amazing","score":4,"reviewCreatedVersion":"4.1.5","sentiment_type":"POSITIVE","sentiment_score":0.9985198379}
{"content":"App crashes so frequently when saving or animating, I hardly get any usable pics","score":2,"reviewCreatedVersion":"4.3.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995030165}
{"content":"So absolutely awesome and oddly on different time planes and so just wow me type creations. Vivid and just Wonderful.","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9987879395}
{"content":"I paid $25 for a lifetime \"pro\" subscription. When I changed phones however, I seen to have lost that. When I hit \"restore\" all of my saved images, and everything else about my profile were the same, except that. Now it wants me to pay another$25. Not happening. I've contacted customer support through the app and on Play, to no avail.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994871616}
{"content":"Good app in funny :grinning_face_with_smiling_eyes:","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9987039566}
{"content":"Love it. The lifetime deal is probably the best deal out there for an app like this.","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9988518953}
{"content":"Paid for the pro version and did not activate. Do not install this app. It will steal your money and the free art is not worth it.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995039701}
{"content":"problem it's not free","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9899021387}
{"content":"Very quick and satisfying creation of pictures after the prompt.","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9989153147}
{"content":"It's not letting me restore purchase after paying for the lifetime deal after getting a new phone...","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994951487}
{"content":"Fun to play around with but the accuracy of the AI engine is very poor. Images are rarely even remotely close to what was described.","score":2,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995045662}
{"content":"Payment without a single use. Useless","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994990826}
{"content":"I tried to get a prompt from it but it wouldn't load at all and then even though I didn't get any pictures i still somehow run out of uses or whatever","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.999499917}
{"content":"I've had to pay twice for this. Please respond.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994846582}
{"content":"worksbut pricy and uses lot internet","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.8959001899}
{"content":"Creative app :OK_hand:","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9973469973}
{"content":"great app. although the subscription I high than I'd like. fun still.","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9986863732}
{"content":"LOVED using this to make basic art references at first. Paid for the life time membership and was having a ton of fun with it. Then I got a new phone and my 'lifetime membership'suddenly wasn't applicable. Unwilling to pay again, and the free version is honestly just too slow and clunky to be enjoyable for what I'm using it for. :upside-down_face: don't waste your money!","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995058775}
{"content":"Trash. Makes you watch an ad before it shows you the artwork everytime. Its not very smart. Entered an easy prompt just to see results. Out of 3 attempts, 3 of the wall results.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994904995}
{"content":"Amazing how A.I. can create nothing into something.:folded_hands::red_heart::thumbs_up:","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9882273078}
{"content":"Love the results. I would recommend.","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9988886714}
{"content":"It WAS my favorite ai art app it was really fun, I'd honestly say it really was a 5 star app (w\/ Pro). Except for the fact that a phone change left me unable to use my Pro that I paid for. It is literally the same account, art I made while I had my old phone is still saved. 2 star is from a\"Restore\" button that -LITERALLY- does nothing, I'd excuse that too if the customer service wasn't terrible. Stay away unless you want to wait 2 minutes between art or plan to have the same phone.","score":2,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994976521}
{"content":"I am not doing a trial with the reviews saying it is garbage","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994814992}
{"content":"I'm new to the AI party, but I'm having a blast so far!","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9988922477}
{"content":"great app, except for the restrictions","score":4,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9967173934}
{"content":"THEY WANT MONEY IT NOT FREE","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9968344569}
{"content":"Awesome app","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9986573458}
{"content":"This app sucks I can't get an evil dragon doc strange fused with monji boo so for two stars I kinda got Raven fused with another she got her wings and cape it look cool","score":2,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995014668}
{"content":"Paid for this app . when I change phones try to restore and it would not work. email them they blew me off. Good app just don't buy.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994831085}
{"content":"Waste of time it asks to upload ten photos I picked ten and it wouldn't go past this stage","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994978905}
{"content":"LOVE IT!!!!","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9988021851}
{"content":"Opens the mind past the normal borders;","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9988200068}
{"content":"not bad","score":3,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9940892458}
{"content":"Adds doesn't even give you the chance to enjoy the app","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994982481}
{"content":"Absolutely HORRIBLE!!!! I did the ai avatars because I wanted something of me and my hubby who passed away unexpectedly last month. It was awful. 50 and not a single one looked anything like us. I cried for hours. And you can't get your money back. DO NOT GET THIS APP!!!!!","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995080233}
{"content":"Fun to use and experiment","score":3,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9988452196}
{"content":"I enjoy these AI generated art apps. I am not completely tech illiterate but I am definitely challenged. The terminology is the biggest struggle for me , trying to figure out the correct terms to use in the prompts. But this app allows me to say pretty much anything and it will produce an image. The commercials for every image sucks , especially when it's just to edit the same image.","score":3,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9985409975}
{"content":"Same issues as everyone else. Had the pro version with unlimited creations and now have to pay again! Total scam, and I want my money back!","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995102882}
{"content":"Your app has lots of potential :smiling_face: but one question, why does your app keep crashing and freezing up? :grinning_face_with_sweat:","score":3,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995094538}
{"content":"Not free asks you to pay right away. Its a scam","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994875193}
{"content":"There is so much to values inside this tool!","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9988382459}
{"content":"Great results, easy to use. Very pleased with outcomes.","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9989342093}
{"content":"I already bought the lifetime free offer and I can't restore the purchase","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994353652}
{"content":"I've had this app for a while now and it always entertains me. Best money I ever spent on an app. Countless nights of making random art and I LOVE that it never gets old.","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9989130497}
{"content":"I paid $20 for a year of fully unlimited use last year. Now it's $25 for lifetime? I already paid almost that much for just 1 year. And even with the lifetime, it still gives you an image cap per day? Yuck. I'd rather the $20 a year for truly unlimited use.","score":2,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9989527464}
{"content":"Ì changed a new phone and now it doesnt let me restore my one-time purchase of the app, it just keeps crashing when i hit restore!!!! Can we do sth about this? I dont want to waste my money!","score":2,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995069504}
{"content":"Literally brought the idea I have been developing for years now TO LIFE! Better than I ever imagined. Thank you wonder!!! I LOVE YOU!","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9988911748}
{"content":"Right on","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9979178309}
{"content":"too many 'community standards' prevents me from creating 'weird' pictures as advertised","score":3,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994823933}
{"content":"Not easy enough","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9980854988}
{"content":"Awful","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.999452889}
{"content":"Man wth! I bought the lifetime subscription and y'all not even letting me use it any more because it's been a while since I used it. It's rip offs like this is what turns people to piracy. Just wish I knew how it worked.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994787574}
{"content":"Amazing app","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9987057447}
{"content":"Great app don't like that you have to pay.","score":4,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.998529315}
{"content":"It is amazing.","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9986041188}
{"content":"amazing","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9985198379}
{"content":"Great app, great price. among the many I tried, definitely my favourite.","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9988570213}
{"content":"I couldn't even do anything because when I clicked on an option it would highlight it in purple & blue colors but it wouldn't go to the next step, I tried again with a few other options & none of them worked they were all just highlighted & when I hit create it won't do anything.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.999509573}
{"content":"With prompts and optional reference images you can create a lot of beautiful images with this app, though the Toon filter is not the best.","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9988026619}
{"content":"my artistic self is pleased","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9987009764}
{"content":"Is anyone else having trouble with the loading? Mine isn't loading","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994969368}
{"content":"I paid for lifetime subscription, bought a new phone, now they just keep telling me to click the restore button which DOESN'T WORK. I've reached out to support multiple times. Very frustrated.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995079041}
{"content":"I feel they can do better, but it's decent","score":3,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9941257238}
{"content":"Can't seem to restore my account no matter what I do","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994953871}
{"content":"Crashes on loading. Pixel 8 pro. Please let the Devs know. That's all the info I have.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.999397397}
{"content":":rolling_on_the_floor_laughing::rolling_on_the_floor_laughing::rolling_on_the_floor_laughing::rolling_on_the_floor_laughing::rolling_on_the_floor_laughing::rolling_on_the_floor_laughing::rolling_on_the_floor_laughing::rolling_on_the_floor_laughing: what a joke, horrible..choppy, way too many long ads, not worth anyones time!!!","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994995594}
{"content":"So cool","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9977915287}
{"content":"Won't let me restore my lifetime paid version to a new device","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994531274}
{"content":"Thought the app was 5 stars but even if you pay for the pro plan, you are still limited to how much art you can generate and it makes you pay to make more, even tho youre already paying the pro price","score":2,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9791193604}
{"content":"I paid for the lifetime subscription. And I cannot get it back by restoring my purchase. Very frustrating and support is very limited.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994946718}
{"content":"Exceptional","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9985576272}
{"content":"At first, I had so much fun with this that I paid £20 for the lifetime subscription quite happily. But recently the very aspects that made me love the art produced by this app have started to disappear. The strangeness, the surrealism, the randomness that made it so fascinating are being discarded in favour of smooth, glossy \"realism\". I used to love the \"Authentic\" style setting because it produced art that was SpaceAge, dreamlike, strange, beautiful, completely original: now it's generic :pensive_face:","score":3,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9988854527}
{"content":"Bought the Wonder Premium and now it won't work, wants me to repurchase it? Update: contacting customer support they just gave me 50 credits :=\/ instead of thr Lifetime I paid for and now the app just hangs and freezes and doesn't work at all","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995043278}
{"content":"Bad one","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.999435246}
{"content":"Very nice app","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9987428784}
{"content":"Awesome software!! excellent interfaces, easy to use, I couldn't be happier!! wonder is the go to app for AI pictures!!!","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.998908639}
{"content":"It's making it more difficult than the ad showed, it's not showing that I have unsubscribed, and I can't uninstall the app!","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995001554}
{"content":"I don't usually write reviews, with that being said out of all the apps I have purchased a \"premium or lifetime subscription\" for, this is the only one that makes you repurchase it if you change phones. I just upgraded the phone ive had for 2 years and now it wants me to rebuy the subscription. Pressing restore on the subscription does nothing either. I used the app less over the last year but now I will be uninstalling it as there's oth","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995037317}
{"content":"They just auto-cancelled my lifetime subscription.","score":1,"reviewCreatedVersion":"3.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994750619}
{"content":"Terrible, popups all over the place and ads required before you even get started.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995112419}
{"content":"I really enjoyed making art with this app, however I just got a new phone and tried to restore purchase for the lifetime subscription I had bought, and it won't do it. I won't give a better rating until I get that restored or they give my money back.","score":2,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9966651797}
{"content":"Pretty Dope, Zero Complaints. Buy the app, especially if you have a vivid imagination!","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.998878181}
{"content":"Accurate","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9976500869}
{"content":"SCAM! DO NOT DOWNLOAD THIS APP! I bought the lifetime pass about a month ago and I logged on a couple days ago and it prompted me to pay again for pro access. They have a restore button at the top but it literally does nothing. I also tried hitting restore in the settings panel. I contacted support repeatedly and have not heard back. This is a blatant scam, do not pay for anything on this app!","score":5,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995135069}
{"content":"Downloaded the app but it doesn't open up. Just a white page with black letters that says wonder. And yes I gave it enough time I actually fell asleep so it had 6 hours to load but never did.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994903803}
{"content":"Wouldn't recommend if you don't want to pay for a subscription","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994657636}
{"content":"The app is cool, is user friendly.","score":4,"reviewCreatedVersion":"4.1.5","sentiment_type":"POSITIVE","sentiment_score":0.9988126755}
{"content":"(EDITED 1\/24)I already bought the lifetime for pro and then I switched phones and now can't access what I already paid for! I was enjoying the app before this issue. I'll rate it 5 stars when I get what I had back! EDIT: Never got my first purchase recovered, but the Pro was worth it. I got good art i used for DMing Pathfinder for my world building. I eventually buckled and just bought it again. Pro is specific to devices not your account so buy at own risk. The App provides plenty of great Art.","score":2,"reviewCreatedVersion":"4.2.0","sentiment_type":"POSITIVE","sentiment_score":0.9952196479}
{"content":"Reduced paintings from 4 to 2 right after paying $25 for Lifetime Wonder Pro... I just paid for this.. I got a feeling this is more than there hardware can handle","score":4,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994255304}
{"content":"it's not what they say","score":2,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994131327}
{"content":"Ads keep making the app out to be magical saying it's free to download, you download it and find that if you want to make unlimited pictures you have to pay for a subscription which is expected. If you don't pay you can still make pictures but you have to watch a 30 to 45 second ad before it creates the art and no matter how detailed or simple you try to be the app does a half job making things look like they came off of a stock photo site. I wouldn't waste your time.","score":2,"reviewCreatedVersion":"1.5.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995114803}
{"content":"Does not even open","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994977713}
{"content":"I payed for premium many years ago but I tried to get this on my new phone and it still makes me watch an add despite PAYING for premium so I don't need to watch an add. This app pretends I'm new even though I've had an account for years an account that, now it won't let me access. And it won't let me access my account because it wants me to pay twice. Do not download this app it is a SCAM!!!!","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995104074}
{"content":"I paid for the Lifetime subscription, which I regret. It's a total waste, and they only give you so many per day unless you pay extra. It takes at least 30 attempts to get an image worth using, and I don't use the app anymore because it is useless. It doesn't follow directions well at all. My last straw was wanting an image of Alan Rickman and Robin Williams, but they both had Alan Rickman's face and 60 fingers.","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995089769}
{"content":"Waste of time","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9992181063}
{"content":"Good app i created a lot photos From here","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9986722469}
{"content":"Was 4*. Changed the mechanics. Added ridiculous volumes of ads and shamelessly attempts to share data to hundreds of third party vendors. From hero to zero. Shambles. Not worth the headache to get through the traps to sign you up to a subscription for a below par AI image generator.","score":1,"reviewCreatedVersion":"3.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995042086}
{"content":"This would be an easy 5 star as it has been awesome for creating art for my dnd campaign and ift has been improved at regular intervals which is awesome. My dropping it down to 3 is because I paid for a lifetime subscription of unlimited uses and the have now put a 50 image limit a day which can be burnt through easily with the trial and error nature of finding the art you want. Feel cheated out of my money with this change, especially as I loved the app and service prior to this","score":3,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9899629951}
{"content":"Total scam..stay away...the lifetime subscription is a lie. Changed phones and lifetime is only device specific. Now with lifetime still get adds and limited to 5 images, and they expect us to pay for credits. And to boot with ads...do not use this app. CUSTOMER SUPPORT IS TRASH, WON'T GET ANYWHERE.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995027781}
{"content":"Paid for lifetime use. It's not giving me pro status. Have emailed support numerous times and they won't respond. Scam . Very disappointing. I've paid twice and it still is trying to charge for a new subscription every time I get a new phone. You've stolen over 50 dollars","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995056391}
{"content":"Paid of the lifetime subscription, but you can not transfer when you get a new phone.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9955412745}
{"content":"Rearly get what i ask for","score":3,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9987261891}
{"content":"Very good for creating background, few word is enough to generate a good artwork","score":5,"reviewCreatedVersion":"4.2.0","sentiment_type":"POSITIVE","sentiment_score":0.9986906648}
{"content":"I paid for lifetime. Like everyone else who changed phones I can't restore and was told that it is device specific. Weird but I also own an iPhone 15 and I logged into my wonder through Google there and it automatically restored my account, albeit to a restricted to 50 credit a day account. Something fishy is going on and it doesn't really seem to be legit. I won't be using this app anymore or supporting anything else this company does until this is looked into and resolved.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.999491334}
{"content":"Terrible customer service. Paid for lifetime, changed devices and when I tried to restore my account, it would not give me my Pro lifetime membership. Contacted customer service via email, they gave me the most generic answer of all, telling me to do steps I already had done. Emailed them back 8 times so far without an answer.","score":1,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995094538}
{"content":"Downloaded on an old phone and bought the lifetime thing to stop the adds. Bought a new phone and downloaded it on there put app won't let me restore it so just lost money basically","score":2,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9994946718}
{"content":"Love this app its great","score":5,"reviewCreatedVersion":"4.2.0","sentiment_type":"POSITIVE","sentiment_score":0.9988715053}
{"content":"The options and art it has and generates is pretty good and seems to be getting better BUT DO NOT BUY THE LIFETIME MEMBERSHIP IT WILL NOT TRANSFER TO OTHER DEVICES. Have tried and all it has is the 50 credits. Seems other people had the same issue. *UPDATE* lol wow. Looks like pro is the 50 credits and not unlimited anymore :clapping_hands: :clapping_hands: well played wonder. You played a lot of people. Yea do not buy pro.","score":2,"reviewCreatedVersion":"4.2.1","sentiment_type":"NEGATIVE","sentiment_score":0.9993151426}
{"content":"Need to be sued , bought life time membership. Then had to switch devices. Now I only get 50 credits per day on new device. Total breach of contract.","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995018244}
{"content":"amazing","score":5,"reviewCreatedVersion":"4.2.1","sentiment_type":"POSITIVE","sentiment_score":0.9985198379}
{"content":"Great","score":5,"reviewCreatedVersion":"4.2.0","sentiment_type":"POSITIVE","sentiment_score":0.9985885024}
{"content":"This app is a cam First,its laggy but i still have to wach an ad Second,after i watched the ad nothing happened","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995087385}
{"content":"slow and misses key words","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994743466}
{"content":"This app is good but I bought the one time lifetime pay option and it won't let me restore my purchase. I've emailed them and all you get is an automated message on how you have to hit restore to get it back but it does not work. Horrible customer service. They are no help. Money down the drain","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995048046}
{"content":"It's decent for one reason Ok, so it's really good when it comes down to the art. The art is really cool, gives you what you input. But my problem is that it glitches a lot. I will be in the middle of an ad (I use free version) and it crashes and uses one credit even though I didn't even get the art. That's the only issue I've found with it, other than that, it's good","score":3,"reviewCreatedVersion":"4.2.0","sentiment_type":"POSITIVE","sentiment_score":0.9955062866}
{"content":"dope","score":5,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.6443959475}
{"content":"Dumbest 20€ i ever spent. I thaught artsy AI would be way more developed by now.","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994778037}
{"content":"I pay your fee so I can use the app a day goes by and my credits don't get renewed and you're telling me I need to buy more credits to keep using the app that I already paid for...","score":2,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.999382019}
{"content":"Bad results,need to improve so much.","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994080067}
{"content":"Checked","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"POSITIVE","sentiment_score":0.9959347248}
{"content":"Terrible just terrible.There was an error code when I tried to make my ai and then it will keep repeating over and over again just a waste of time","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995127916}
{"content":"It's pre sick","score":5,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9935972691}
{"content":"A bit narrow in its use and you have to pay or watch videos to generate, which I get, using a cool new toy and having to pay via letting them sell my attention to an advertiser to monetize it but it's limited to on 5 videos or ads to watch before you have to pay....eh :man_shrugging:","score":3,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9967218041}
{"content":"Terrible. Like seriously whats the point. It's basically a copy and paste of another app but worse. Can't even make me a angry balloon. The generated images even though simple are awful. Don't bother !!","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995045662}
{"content":"Trash images everytime, other AI programs are better this one gives me strange results when compared to others they're never consistent and somewhat cheap looking","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9989547729}
{"content":"Best free ai generator Ive found.","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9979187846}
{"content":"I hate it","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994086027}
{"content":"Used to be great....then they started taking features away from users who paid the one time fee. Its actually almost as bad as paying for a game and then suddenly it getting torn away from you.","score":3,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995002747}
{"content":"Bad, terrible AI","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.99948138}
{"content":"My advice . Dont buy any credit ...it is money loss. Images generated totaly different than the sample one showing you, ex: kids will became an adult and woman be a man.. it is a mess. Sometimes it generates nothing, a white screen, and all this mistakes, and points continue deducting from ur credit.","score":1,"reviewCreatedVersion":"4.1.1","sentiment_type":"NEGATIVE","sentiment_score":0.9995077848}
{"content":"Fake app. Nothing works. It keeps showing ads.","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994937181}
{"content":"I switched devices now my lifetime subscription is not recognised by the apo. Great. Even after engaging with gooogle for a refund no response. This is a criminal thieving company. Dont support them","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995014668}
{"content":"Just an app to scam you for money. Deinstalled within 2min of install.","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994986057}
{"content":"I paid for the lifetime subscription when it removed ads and there was no cap on images produced. They've recently instituted a credits system on top of the subscription fee. I understand that it may not be sustainable for a person to get unlimited images for a one-time fee, but that's what I signed up and paid for.","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"POSITIVE","sentiment_score":0.9981795549}
{"content":"This is what I have been looking for but too many ads","score":4,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994803071}
{"content":"The images are good and it allows you to recreate if you don't like the image you get","score":4,"reviewCreatedVersion":"4.2.0","sentiment_type":"POSITIVE","sentiment_score":0.9987904429}
{"content":"Worst app and give you worst face and dont apply that word you give it and more capitalism","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995020628}
{"content":"I already purchased it om my other phone and it won't restore. big scam","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994440675}
{"content":"I'm obsessed I love this app the most out of numerous apps similar to this .... Number 1 on my list!!!","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9989122152}
{"content":"You know you guys use to be Real good back then and only had to use Ads if you wanted to continue making Ai posts but now I only get 3 tries before a limited reach??? You guys SUCK BAD for that now.","score":1,"reviewCreatedVersion":"1.4.3","sentiment_type":"NEGATIVE","sentiment_score":0.9995048046}
{"content":"loving it","score":5,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.998837769}
{"content":"This company is a scam. They don't honor their \"lifetime subscription\" in case you switch your phone. Their customer support just stops responding.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995002747}
{"content":"Downloaded this as it looked pretty cool and has a ton of reviews. Once u opened the app, it immediately asks for money or a freet trial. I did continue on to make my first Funko pop character using a personal picture. The Funko pop it produced made me have a long beard and black hair. I have no facial hair in the picture used and my hair is light brown. Not really a great AI app if it can't even follow a picture.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9994499087}
{"content":"Fantastic.","score":5,"reviewCreatedVersion":"4.1.5","sentiment_type":"POSITIVE","sentiment_score":0.9984057546}
{"content":"Horrible App and Services - I bought a lifetime premium plan, yet after changing my phone and logging back in, I couldn't access the plan. I tried to restore it and emailed the company but didn't receive any response. They have 0 support service. Not worth spending money.","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9995059967}
{"content":"I paid for lifetime and none of the art looks like the pictures I use I either come out looking asian or african american. I want a refund.","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995000362}
{"content":"it creates other people","score":2,"reviewCreatedVersion":"4.2.0","sentiment_type":"POSITIVE","sentiment_score":0.9975515008}
{"content":"Tried to restore lifetime subscription and it will not restore it I am never going to recommend this thieving app to anyone what garbage","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9995024204}
{"content":"So cool :smiling_face_with_sunglasses: & Amazing :relieved_face::sparkles:","score":5,"reviewCreatedVersion":"4.1.5","sentiment_type":"POSITIVE","sentiment_score":0.9986338019}
{"content":"Really great application","score":5,"reviewCreatedVersion":"4.0.5","sentiment_type":"POSITIVE","sentiment_score":0.9987125397}
{"content":"Bad","score":1,"reviewCreatedVersion":null,"sentiment_type":"NEGATIVE","sentiment_score":0.9991268516}
{"content":"decent but when I type its kinda laggy","score":3,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9989552498}
{"content":"I paid for AI avatars that I didn't receive I want a refund. This is a scam do not spend your money in this app you will not get anything.","score":1,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9995038509}
{"content":"I've been using this app for approx 1 year. Easy to use and getting better and better at counting fingers. Unlike many other more accessible apps, I very much appreciate the ability to input an image that blends with the typed in description. It would be almost perfect if the app permitted the user to weight the influence of the image vis a vis the typed description, but maybe we'll get there someday. There seem to be constant small improvements.","score":5,"reviewCreatedVersion":"4.1.5","sentiment_type":"POSITIVE","sentiment_score":0.9988534451}
{"content":"I absolutely love this!! I used it to make so many things but sometimes when I do people they come out a bit weird. One of them a leg was completely missing and on another the legs were tiny and the body was long and it looked unproportional. Either way I love this app and I can't wait till tommorow when I can make another 5 pictures","score":4,"reviewCreatedVersion":"4.1.5","sentiment_type":"POSITIVE","sentiment_score":0.9988858104}
{"content":"I only used the 5 free credits and this is the only tattoo generator app I would actually pay for.","score":5,"reviewCreatedVersion":"4.2.0","sentiment_type":"NEGATIVE","sentiment_score":0.9974942207}
{"content":"This is :ON!_arrow::TOP_arrow:","score":4,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9935926795}
{"content":"I usually enjoy using the app despite the fact that some things it really struggles with. Like Wile E Coyote. It just can't and won't. That being said, for like the past month now, I can't even get the app to open and I don't want to uninstall it and reinstall it just in case I run into further issues and can't redeem my previous payment in the app.","score":3,"reviewCreatedVersion":"1.5.0","sentiment_type":"NEGATIVE","sentiment_score":0.9994864464}
{"content":"This used to be a great app but it has become money hungry. I paid for the pro version (promised add free unlimited image generation). Now I have to buy credits to generate images without adds. I must also note that you cannot restore purchases. If these thing are fixed, I'll gladly edit my review and give more stars.","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9987200499}
{"content":"my lifetime subscription disappeared in the money grab :man_zombie:","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994478822}
{"content":"Fun, but charging that much is a bit of a money grab.","score":2,"reviewCreatedVersion":null,"sentiment_type":"POSITIVE","sentiment_score":0.9960713387}
{"content":"Fun and fast renderings. Easy to use, but terrible approach to synching your account to new devices. Doesn't seem to work.","score":2,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994575381}
{"content":"it's as good as it says it is.","score":5,"reviewCreatedVersion":"4.1.5","sentiment_type":"POSITIVE","sentiment_score":0.9986516833}
{"content":"I loved using this application before but now that I have a new phone it tells me I have to buy the subscription again mind you I already bought the lifetime subscription once oh and refunds are impossible.","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994786382}
{"content":":cyclone::cyclone::cyclone::cyclone::cyclone::crown::crown::crown::crown::smiling_face_with_smiling_eyes::smiling_face_with_smiling_eyes::smiling_face_with_smiling_eyes::beaming_face_with_smiling_eyes::beaming_face_with_smiling_eyes::beaming_face_with_smiling_eyes:","score":5,"reviewCreatedVersion":"4.1.5","sentiment_type":"POSITIVE","sentiment_score":0.9941174984}
{"content":"not too good","score":3,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9993647933}
{"content":"nice","score":5,"reviewCreatedVersion":"4.1.5","sentiment_type":"POSITIVE","sentiment_score":0.9972729087}
{"content":"I'd love to give a five star rating but unfortunately I don't have access to the pro version. I'm still figuring out what exact words to use to get the pictures I'm imagining so far nothing really been close but I gotta say the images the ai is creating are pretty awesome!","score":4,"reviewCreatedVersion":"4.1.5","sentiment_type":"POSITIVE","sentiment_score":0.9986693859}
{"content":"Does not use your words at all","score":1,"reviewCreatedVersion":"4.1.5","sentiment_type":"NEGATIVE","sentiment_score":0.9994820952}
{"content":"Best AI photo generator ever!!!","score":5,"reviewCreatedVersion":"4.1.5","sentiment_type":"POSITIVE","sentiment_score":0.9984671474}
